#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Взвращает массив индексов повышения версий
// 
// Возвращаемое значение:
//	Массив Из ПеречислениеСсылка.кфкВидыПовышенияВерсий - Массив индексов
Функция Индексы() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ОсновнаяВерсия);
	Результат.Добавить(ДополняющаяВерсия);
	Результат.Добавить(ВерсияИсправления);
	Результат.Добавить(ПустаяСсылка());
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
