#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПослеЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий)
	
	РегистрыСведений.кфкИзмененияОбъектовСпецификаций.ОбработкаЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВидПовышения(Данные, История, ЭтоНовый) Экспорт
	
	ВидыПовышения = Перечисления.кфкВидыПовышенияВерсий;
	Если ТипЗнч(История) = Тип("ИнформацияОЗаписиВерсииИсторииДанных") Тогда
		Возврат кфкРаботаСоСпецификациями.ПолучитьИндексСобытия(
			История, ЭтоНовый, ВидыПовышения.ОсновнаяВерсия, ВидыПовышения.ОсновнаяВерсия);
	КонецЕсли;
	
	РезультатыКлассификации = Новый Массив;
	Для Каждого КлючЗначение Из История Цикл
		ИмяРеквизита = КлючЗначение.Ключ;
		Если ИмяРеквизита = "ПометкаУдаления" Или ИмяРеквизита = "АдресТопика" Тогда
			ВидПовышения = ВидыПовышения.ОсновнаяВерсия;
		ИначеЕсли ИмяРеквизита = "ПравилаОбмена" Тогда
			ВидПовышения = ВидыПовышения.ДополняющаяВерсия;
		ИначеЕсли ИмяРеквизита = "Наименование" Или ИмяРеквизита = "ИмяСхемы"
				Или ИмяРеквизита = "ИмяКанала" Или ИмяРеквизита = "ИмяОперации"
				Или ИмяРеквизита = "ИмяСообщения" Или ИмяРеквизита = "ИмяСообщенияКанала" Тогда
			ВидПовышения = ВидыПовышения.ВерсияИсправления;
		Иначе
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Неизвестное имя реквизита: %1'"), ИмяРеквизита);
		КонецЕсли;
		РезультатыКлассификации.Добавить(ВидПовышения);
	КонецЦикла;
	
	Возврат кфкРаботаСоСпецификациями.ПолучитьИндексИзменений(
		РезультатыКлассификации);
	
КонецФункции

#КонецОбласти

#КонецЕсли
