#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДеревоСвойств();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДерево

&НаКлиенте
Процедура ДеревоДобавитьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Добавить = 2 Тогда
		ТекущиеДанные.Добавить = 0;
	КонецЕсли;

	УстановитьПометкиПодчиненных(ТекущиеДанные);
	УстановитьПометкиРодителей(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ДеревоСвойствоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ТекущиеДанные.ПолучитьЭлементы().Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Добавить = 1;
	УстановитьПометкиРодителей(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьСвойства(Команда)
	
	Результат = ДобавитьСвойстваНаСервере();
	Если Результат.Успешно Тогда
		Закрыть(Истина);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПометкиПодчиненных(ТекущаяСтрока)
	
	Для Каждого Строка Из ТекущаяСтрока.ПолучитьЭлементы() Цикл
		Строка.Добавить = ТекущаяСтрока.Добавить;
		УстановитьПометкиПодчиненных(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиРодителей(ТекущаяСтрока)
	
	ТекущийРодитель = ТекущаяСтрока.ПолучитьРодителя();
	Если ТекущийРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденыВключенные = Ложь;
	НайденыВыключенные = Ложь;
	Для Каждого Строка Из ТекущийРодитель.ПолучитьЭлементы() Цикл
		Если Строка.Добавить = 0 Тогда
			НайденыВыключенные = Истина;
		ИначеЕсли Строка.Добавить = 1 Или Строка.Добавить = 2 Тогда
			НайденыВключенные = Истина;
		КонецЕсли;
		Если НайденыВключенные И НайденыВыключенные Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если НайденыВключенные И НайденыВыключенные Тогда
		Включить = 2;
	ИначеЕсли НайденыВключенные Тогда
		Включить = 1;
	ИначеЕсли НайденыВыключенные Тогда
		Включить = 0;
	Иначе
		Включить = 2;
	КонецЕсли;

	Если Включить <> ТекущийРодитель.Добавить Тогда
		ТекущийРодитель.Добавить = Включить;
		УстановитьПометкиРодителей(ТекущийРодитель);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоСвойств()
	
	ДеревоЗначений = РеквизитФормыВЗначение("Дерево");
	кфкРаботаСоСпецификациями.ЗаполнитьДерево(
		ДеревоЗначений, Параметры.ОбъектКонфигурации, Параметры.Спецификация, Параметры.ТипДанных);
	ЗначениеВРеквизитФормы(ДеревоЗначений, "Дерево");
	
КонецПроцедуры

&НаСервере
Функция ДобавитьСвойстваНаСервере()
	
	ДеревоСвойств = РеквизитФормыВЗначение("Дерево");
	Возврат Справочники.кфкТипыДанныхСпецификации.СоздатьСвойства(
		Параметры.Спецификация, Параметры.ТипДанных, ДеревоСвойств);
	
КонецФункции

#КонецОбласти
