
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДеревоСвойств();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДерево

&НаКлиенте
Процедура ДеревоДобавитьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Добавить = 2 Тогда
		ТекущиеДанные.Добавить = 0;
	КонецЕсли;

	УстановитьПометкиПодчиненных(ТекущиеДанные);
	УстановитьПометкиРодителей(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ДеревоСвойствоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ТекущиеДанные.ПолучитьЭлементы().Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Добавить = 1;
	
	УстановитьПометкиРодителей(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьСвойства(Команда)
	
	Результат = ДобавитьСвойстваНаСервере();
	Если Результат.Успешно Тогда
		Закрыть(Истина);
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПометкиПодчиненных(ТекущаяСтрока)
	
	Для Каждого Строка Из ТекущаяСтрока.ПолучитьЭлементы() Цикл
		Строка.Добавить = ТекущаяСтрока.Добавить;
		УстановитьПометкиПодчиненных(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиРодителей(ТекущаяСтрока)
	
	ТекущийРодитель = ТекущаяСтрока.ПолучитьРодителя();
	Если ТекущийРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденыВключенные = Ложь;
	НайденыВыключенные = Ложь;
	
	Для Каждого Строка Из ТекущийРодитель.ПолучитьЭлементы() Цикл
		
		Если Строка.Добавить = 0 Тогда
			НайденыВыключенные = Истина;
			
		ИначеЕсли Строка.Добавить = 1 Или Строка.Добавить = 2 Тогда
			НайденыВключенные = Истина;
			
		КонецЕсли;
		
		Если НайденыВключенные И НайденыВыключенные Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

	Если НайденыВключенные И НайденыВыключенные Тогда
		Включить = 2;
		
	ИначеЕсли НайденыВключенные И (Не НайденыВыключенные) Тогда
		Включить = 1;
		
	ИначеЕсли (Не НайденыВключенные) И НайденыВыключенные Тогда
		Включить = 0;
		
	ИначеЕсли (Не НайденыВключенные) И (Не НайденыВыключенные) Тогда
		Включить = 2;
		
	КонецЕсли;

	Если Включить = ТекущийРодитель.Добавить Тогда
		Возврат;
		
	Иначе
		ТекущийРодитель.Добавить = Включить;
		УстановитьПометкиРодителей(ТекущийРодитель);
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СвойстваОбъектаКонфигурации(ОбъектКонфигурации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Свойства.Ссылка КАК Ссылка,
	|	Свойства.Родитель КАК Родитель,
	|	Свойства.Наименование КАК Наименование,
	|	Свойства.Синоним КАК Синоним,
	|	Свойства.Вид КАК Вид,
	|	Свойства.КвалификаторыЧисла_Длина КАК КвалификаторыЧисла_Длина,
	|	Свойства.КвалификаторыЧисла_Точность КАК КвалификаторыЧисла_Точность,
	|	Свойства.КвалификаторыЧисла_Неотрицательное КАК КвалификаторыЧисла_Неотрицательное,
	|	Свойства.КвалификаторыСтроки_Длина КАК КвалификаторыСтроки_Длина,
	|	Свойства.КвалификаторыСтроки_Фиксированная КАК КвалификаторыСтроки_Фиксированная,
	|	Свойства.КвалификаторыДаты_Состав КАК КвалификаторыДаты_Состав,
	|	Свойства.ТипыСтрокой КАК ТипыСтрокой,
	|	СвойстваТипы.Тип КАК Тип,
	|	ВЫБОР
	|		КОГДА ТОбъекты.Тип В (&СсылочныеТипыОбъектов)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.УникальныйИдентификатор)
	|		ИНАЧЕ ТОбъекты.Тип
	|	КОНЕЦ КАК ТипТипа
	|ПОМЕСТИТЬ ВТВсеТипыСвойствОбъекта
	|ИЗ
	|	Справочник.Свойства КАК Свойства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Свойства.Типы КАК СвойстваТипы
	|		ПО Свойства.Ссылка = СвойстваТипы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Объекты КАК ТОбъекты
	|		ПО СвойстваТипы.Тип = ТОбъекты.Ссылка
	|ГДЕ
	|	(Свойства.Владелец = &ОбъектКонфигурации
	|	ИЛИ Свойства.Родитель = &ОбъектКонфигурации)
	|	И Свойства.ЭтоГруппа = ЛОЖЬ
	|	И Свойства.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТСвойстваСоставногоТипа
	|ИЗ
	|	ВТВсеТипыСвойствОбъекта КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Ссылка
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Родитель КАК Родитель,
	|	Т.Наименование КАК Наименование,
	|	Т.Синоним КАК Синоним,
	|	Т.КвалификаторыЧисла_Длина КАК КвалификаторыЧисла_Длина,
	|	Т.КвалификаторыЧисла_Точность КАК КвалификаторыЧисла_Точность,
	|	Т.КвалификаторыЧисла_Неотрицательное КАК КвалификаторыЧисла_Неотрицательное,
	|	Т.КвалификаторыСтроки_Длина КАК КвалификаторыСтроки_Длина,
	|	Т.КвалификаторыСтроки_Фиксированная КАК КвалификаторыСтроки_Фиксированная,
	|	Т.КвалификаторыДаты_Состав КАК КвалификаторыДаты_Состав,
	|	Т.ТипыСтрокой КАК ТипыСтрокой,
	|	Т.Тип КАК Тип,
	|	Т.ТипТипа КАК ТипТипа
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т1.Ссылка КАК Ссылка,
	|		Т1.Родитель КАК Родитель,
	|		Т1.Наименование КАК Наименование,
	|		Т1.Синоним КАК Синоним,
	|		Т1.Вид КАК Вид,
	|		Т1.КвалификаторыЧисла_Длина КАК КвалификаторыЧисла_Длина,
	|		Т1.КвалификаторыЧисла_Точность КАК КвалификаторыЧисла_Точность,
	|		Т1.КвалификаторыЧисла_Неотрицательное КАК КвалификаторыЧисла_Неотрицательное,
	|		Т1.КвалификаторыСтроки_Длина КАК КвалификаторыСтроки_Длина,
	|		Т1.КвалификаторыСтроки_Фиксированная КАК КвалификаторыСтроки_Фиксированная,
	|		Т1.КвалификаторыДаты_Состав КАК КвалификаторыДаты_Состав,
	|		ВЫРАЗИТЬ(Т1.ТипыСтрокой КАК СТРОКА(1000)) КАК ТипыСтрокой,
	|		ВЫБОР
	|			КОГДА Т2.Ссылка ЕСТЬ NULL
	|				ТОГДА Т1.ТипТипа
	|		КОНЕЦ КАК ТипТипа,
	|		ВЫБОР
	|			КОГДА Т2.Ссылка ЕСТЬ NULL
	|			И Т3.Ссылка ЕСТЬ NULL
	|				ТОГДА Т1.Тип
	|		КОНЕЦ КАК Тип
	|	ИЗ
	|		ВТВсеТипыСвойствОбъекта КАК Т1
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСвойстваСоставногоТипа КАК Т2
	|			ПО Т1.Ссылка = Т2.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеТипыСвойствОбъекта КАК Т3
	|			ПО Т1.Ссылка = Т3.Ссылка
	|			И Т1.ТипТипа = Т3.ТипТипа
	|			И Т1.Тип <> Т3.Тип) КАК Т
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА Т.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ТабличнаяЧасть)
	|			ТОГДА 4
	|		КОГДА Т.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.Реквизит)
	|			ТОГДА 3
	|		КОГДА Т.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.Свойство)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	Т.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Свойства.Ссылка КАК Ссылка,
	|	Свойства.Наименование КАК Наименование,
	|	Свойства.Синоним КАК Синоним
	|ИЗ
	|	Справочник.Свойства КАК Свойства
	|ГДЕ
	|	Свойства.Владелец = &ОбъектКонфигурации
	|	И Свойства.Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)
	|	И Свойства.ЭтоГруппа = ИСТИНА
	|	И Свойства.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Свойства.Наименование";
	Запрос.УстановитьПараметр("ОбъектКонфигурации", ОбъектКонфигурации);
	Запрос.УстановитьПараметр("СсылочныеТипыОбъектов", СсылочныеТипыОбъектов());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Реквизиты = Неопределено;
	ТабЧасти = Неопределено;
	Если ТипЗнч(ОбъектКонфигурации) = Тип("СправочникСсылка.Объекты") Тогда
		// реквизиты объекта и табличные части 
		ВсеРеквизиты = РезультатЗапроса[РезультатЗапроса.ВГраница()-1].Выгрузить(); // ТаблицаЗначений
		ВсеРеквизиты.Индексы.Добавить("Родитель");
		
		// Реквизиты объекта
		Реквизиты = ВсеРеквизиты.Скопировать(Новый Структура("Родитель", Справочники.Свойства.ПустаяСсылка()));
		//@skip-check bsl-legacy-check-expression-type
		Реквизиты.Колонки.Удалить("Родитель");
		
		// Табличные части
		ТабЧасти = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить();
		ТабЧасти.Колонки.Добавить("Реквизиты", Новый ОписаниеТипов("ТаблицаЗначений"));
		// Реквизиты табличных частей
		
		// Добавим сразу реквизиты табличных частей в табличные части 
		Для Каждого ТЧ Из ТабЧасти Цикл
			ТЧ.Реквизиты = ВсеРеквизиты.Скопировать(Новый Структура("Родитель", ТЧ.Ссылка));
			ТЧ.Реквизиты.Колонки.Удалить("Родитель");
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ОбъектКонфигурации) = Тип("СправочникСсылка.Свойства") Тогда
		// реквизиты табличной части 
		Реквизиты = РезультатЗапроса[РезультатЗапроса.ВГраница()-1].Выгрузить(); // ТаблицаЗначений
		//@skip-check bsl-legacy-check-expression-type
		Реквизиты.Колонки.Удалить("Родитель");
		ТабЧасти = Новый Массив;
		
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный тип объекта конфигурации: %1'"), ОбъектКонфигурации);
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Новый Структура("Реквизиты, ТабличныеЧасти", Реквизиты, ТабЧасти);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПеречисленияСпецификации(Спецификация)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Справочник.кфкПеречисленияСпецификации.Ссылка, ОбъектКонфигурации
	|ГДЕ Владелец = &Спецификация И ПометкаУдаления = ЛОЖЬ И ОбъектКонфигурации <> ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ОбъектКонфигурации, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НавигацияПоКолонке(Дерево, ИмяКолонки, Приемник = Неопределено)
	
	Если Приемник = Неопределено Тогда
		Приемник = Новый Соответствие;
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Значение = СтрокаДерева[ИмяКолонки];
		Если ЗначениеЗаполнено(Значение) Тогда
			Приемник.Вставить(Значение, СтрокаДерева);
		КонецЕсли;
		
		НавигацияПоКолонке(СтрокаДерева, ИмяКолонки, Приемник);
		
	КонецЦикла;
	
	Возврат Приемник;
	
КонецФункции

&НаСервереБезКонтекста
Функция СсылочныеТипыОбъектов()
	
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.ТипыОбъектов.ЛюбаяСсылка);
	Результат.Добавить(Перечисления.ТипыОбъектов.Справочник);
	Результат.Добавить(Перечисления.ТипыОбъектов.Документ);
	Результат.Добавить(Перечисления.ТипыОбъектов.ПланВидовХарактеристик);
	Результат.Добавить(Перечисления.ТипыОбъектов.ПланСчетов);
	Результат.Добавить(Перечисления.ТипыОбъектов.ПланВидовРасчета);
	Результат.Добавить(Перечисления.ТипыОбъектов.ПланОбмена);
	Результат.Добавить(Перечисления.ТипыОбъектов.БизнесПроцесс);
	Результат.Добавить(Перечисления.ТипыОбъектов.Задача);
	Результат.Добавить(Перечисления.ТипыОбъектов.ТочкаМаршрутаБизнесПроцесса);
	Результат.Добавить(Перечисления.ТипыОбъектов.ВидРасчета);
	Результат.Добавить(Перечисления.ТипыОбъектов.ВидСубконто);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоСвойств()
	
	Строки = Дерево.ПолучитьЭлементы();
	Строки.Очистить();
	
	Свойства = СвойстваОбъектаКонфигурации(Параметры.ОбъектКонфигурации);
	Реквизиты = Свойства.Реквизиты; // ТаблицаЗначений
	ТабЧасти = Свойства.ТабличныеЧасти; // ТаблицаЗначений
	
	ПеречисленияСпецификации = ПеречисленияСпецификации(Параметры.Спецификация);
	
	ЭлементыТипаДанных = Справочники.кфкТипыДанныхСпецификации.ПодчинныеЭлементы(Параметры.ТипДанных);
	СвойстваТипаДанных = НавигацияПоКолонке(ЭлементыТипаДанных, "ОбъектКонфигурации");
	
	// Реквизиты объекта конфигурации
	Для Каждого Реквизит Из Реквизиты Цикл
		ДобавитьСвойствоВДерево(Строки, Реквизит, СвойстваТипаДанных, ПеречисленияСпецификации);
	КонецЦикла;
	
	// Табличные части объекта конфигурации
	Для Каждого ТабЧасть Из ТабЧасти Цикл
		
		// Если табличная часть уже есть в спецификации, то выводим только те реквизиты, которые еще не добавлены в спецификацию.
		// Если табличная часть не добавлена в спецификацию, то выводим все реквизиты
		Свойство = СвойстваТипаДанных.Получить(ТабЧасть.Ссылка);
		Если Свойство <> Неопределено Тогда
			ТребуетсяВывести = Ложь;
			Для Каждого Реквизит Из ТабЧасть.Реквизиты Цикл
				Если СвойстваТипаДанных.Получить(Реквизит.Ссылка) = Неопределено Тогда
					ТребуетсяВывести = Истина;
				КонецЕсли;
			КонецЦикла;
			Если Не ТребуетсяВывести Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = Строки.Добавить();
		НоваяСтрока.СвойствоКонфигурации = ТабЧасть.Ссылка;
		НоваяСтрока.Свойство = ?(Свойство = Неопределено, Неопределено, Свойство.Код);
		НоваяСтрока.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Массив;
		НоваяСтрока.Ссылка = ?(Свойство = Неопределено, Неопределено, Свойство.Ссылка);
		
		СтрокиТЧ = НоваяСтрока.ПолучитьЭлементы();
		
		// Реквизиты табличной части
		Для Каждого Реквизит Из ТабЧасть.Реквизиты Цикл	
			ДобавитьСвойствоВДерево(СтрокиТЧ, Реквизит, СвойстваТипаДанных, ПеречисленияСпецификации);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСвойствоВДерево(Строки, Реквизит, СвойстваТипаДанных, ПеречисленияСпецификации)
	
	Свойство = СвойстваТипаДанных.Получить(Реквизит.Ссылка);
	Если Свойство <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Строки.Добавить();
	НоваяСтрока.СвойствоКонфигурации = Реквизит.Ссылка;
	НоваяСтрока.СвойствоКонфигурацииНаименование = Реквизит.Наименование;
	НоваяСтрока.СвойствоКонфигурацииСиноним = Реквизит.Синоним;
	НоваяСтрока.ТипСвойстваКонфигурации = Реквизит.ТипыСтрокой;
	НоваяСтрока.Тип = Реквизит.Тип;
	НоваяСтрока.ТипТипа = Реквизит.ТипТипа;
	НоваяСтрока.Свойство = ?(Свойство = Неопределено, Неопределено, Свойство.Код); // Неопределено -> Наименование+Синоним
	НоваяСтрока.ТипДанных = Неопределено;
	НоваяСтрока.ФорматДанных = Неопределено;
	НоваяСтрока.Перечисление = Неопределено;
	НоваяСтрока.Минимум = Неопределено;
	НоваяСтрока.Максимум = Неопределено;
	НоваяСтрока.Ссылка = ?(Свойство = Неопределено, Неопределено, Свойство.Ссылка);
	
	ТипыЗначений = Справочники.кфкТипыЗначенийСпецификации;
	Если Реквизит.ТипТипа = Перечисления.ТипыОбъектов.Строка Тогда
		НоваяСтрока.ТипДанных = ТипыЗначений.Строка;
		НоваяСтрока.Максимум = ?(Реквизит.КвалификаторыСтроки_Длина = 0, Неопределено, Реквизит.КвалификаторыСтроки_Длина);
		
	ИначеЕсли Реквизит.ТипТипа = Перечисления.ТипыОбъектов.Число Тогда
		Если Реквизит.КвалификаторыЧисла_Точность = 0 Тогда
			НоваяСтрока.ТипДанных = ТипыЗначений.ЦелоеЧисло;
			НоваяСтрока.ФорматДанных = ?(Реквизит.КвалификаторыЧисла_Длина <= 9,
				ТипыЗначений.ЦелоеЧисло32, ТипыЗначений.ЦелоеЧисло64);
			
		Иначе
			НоваяСтрока.ТипДанных = ТипыЗначений.Число;
			НоваяСтрока.ФорматДанных = ?(Реквизит.КвалификаторыЧисла_Длина <= 7,
				ТипыЗначений.ДробноеЧисло, ТипыЗначений.ДробноеДвойнойТочности);
			
		КонецЕсли;
		
	ИначеЕсли Реквизит.ТипТипа = Перечисления.ТипыОбъектов.Булево Тогда
		НоваяСтрока.ТипДанных = ТипыЗначений.Логический;
		
	ИначеЕсли Реквизит.ТипТипа = Перечисления.ТипыОбъектов.Дата Тогда
		НоваяСтрока.ТипДанных = ТипыЗначений.Строка;
		Состав = НРег(СокрЛП(Реквизит.КвалификаторыДаты_Состав));
		Если Состав = "дата" Тогда
			НоваяСтрока.ФорматДанных = ТипыЗначений.Дата;
			
		ИначеЕсли Состав = "время" Тогда
			НоваяСтрока.ФорматДанных = ТипыЗначений.Время;
			
		Иначе
			НоваяСтрока.ФорматДанных = ТипыЗначений.ДатаВремя;
			
		КонецЕсли;
		
	ИначеЕсли Реквизит.ТипТипа = Перечисления.ТипыОбъектов.ХранилищеЗначения Тогда
		НоваяСтрока.ТипДанных = ТипыЗначений.Строка;
		НоваяСтрока.ФорматДанных = ТипыЗначений.ДанныеBase64;
		
	ИначеЕсли Реквизит.ТипТипа = Перечисления.ТипыОбъектов.УникальныйИдентификатор Тогда
		НоваяСтрока.ТипДанных = ТипыЗначений.Строка;
		НоваяСтрока.ФорматДанных = ТипыЗначений.УникальныйИдентификатор;
		
	ИначеЕсли Реквизит.ТипТипа = Перечисления.ТипыОбъектов.Перечисление Тогда
		НоваяСтрока.ТипДанных = ТипыЗначений.Строка;
		НоваяСтрока.Перечисление = ?(ЗначениеЗаполнено(Реквизит.Тип),
			ПеречисленияСпецификации.Получить(Реквизит.Тип), Неопределено);
		
	Иначе
		НоваяСтрока.ТипДанных = ТипыЗначений.Строка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьСвойстваНаСервере()
	
	ДеревоСвойств = РеквизитФормыВЗначение("Дерево");
	Возврат Справочники.кфкТипыДанныхСпецификации.СоздатьСвойства(
		Параметры.Спецификация, Параметры.ТипДанных, ДеревоСвойств);
	
КонецФункции

#КонецОбласти
