
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДеревоСвойств();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДерево

&НаКлиенте
Процедура ДеревоДобавитьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Добавить = 2 Тогда
		ТекущиеДанные.Добавить = 0;
	КонецЕсли;

	УстановитьПометкиПодчиненных(ТекущиеДанные);
	УстановитьПометкиРодителей(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ДеревоСвойствоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ТекущиеДанные.ПолучитьЭлементы().Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Добавить = 1;
	
	УстановитьПометкиРодителей(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьСвойства(Команда)
	
	Результат = ДобавитьСвойстваНаСервере();
	Если Результат.Успешно Тогда
		Закрыть(Истина);
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПометкиПодчиненных(ТекущаяСтрока)
	
	Для Каждого Строка Из ТекущаяСтрока.ПолучитьЭлементы() Цикл
		Строка.Добавить = ТекущаяСтрока.Добавить;
		УстановитьПометкиПодчиненных(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиРодителей(ТекущаяСтрока)
	
	ТекущийРодитель = ТекущаяСтрока.ПолучитьРодителя();
	Если ТекущийРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденыВключенные = Ложь;
	НайденыВыключенные = Ложь;
	
	Для Каждого Строка Из ТекущийРодитель.ПолучитьЭлементы() Цикл
		
		Если Строка.Добавить = 0 Тогда
			НайденыВыключенные = Истина;
			
		ИначеЕсли Строка.Добавить = 1 Или Строка.Добавить = 2 Тогда
			НайденыВключенные = Истина;
			
		КонецЕсли;
		
		Если НайденыВключенные И НайденыВыключенные Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

	Если НайденыВключенные И НайденыВыключенные Тогда
		Включить = 2;
		
	ИначеЕсли НайденыВключенные И (Не НайденыВыключенные) Тогда
		Включить = 1;
		
	ИначеЕсли (Не НайденыВключенные) И НайденыВыключенные Тогда
		Включить = 0;
		
	ИначеЕсли (Не НайденыВключенные) И (Не НайденыВыключенные) Тогда
		Включить = 2;
		
	КонецЕсли;

	Если Включить = ТекущийРодитель.Добавить Тогда
		Возврат;
		
	Иначе
		ТекущийРодитель.Добавить = Включить;
		УстановитьПометкиРодителей(ТекущийРодитель);
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СвойстваОбъектаКонфигурации(ОбъектКонфигурации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка) КАК Ссылка,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТПриоритетыТипаЗначений
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Число),
	|	2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Логический),
	|	3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Строка) КАК ТипОбъекта,
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка) КАК ТипДанных
	|ПОМЕСТИТЬ ВТТипОбъекта2ТипДанных
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Дата),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Число),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Число)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Булево),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Логический)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ХранилищеЗначения),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.УникальныйИдентификатор),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Справочник),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Документ),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Перечисление),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланВидовХарактеристик),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланСчетов),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланВидовРасчета),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланОбмена),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.БизнесПроцесс),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Задача),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ТочкаМаршрутаБизнесПроцесса),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ВидРасчета),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ВидСубконто),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ЛюбаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Строка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Свойства.Ссылка КАК Ссылка,
	|	Свойства.Родитель КАК Родитель,
	|	Свойства.Наименование КАК Наименование,
	|	Свойства.Синоним КАК Синоним,
	|	Свойства.Вид КАК Вид,
	|	Свойства.КвалификаторыЧисла_Длина КАК КвалификаторыЧисла_Длина,
	|	Свойства.КвалификаторыЧисла_Точность КАК КвалификаторыЧисла_Точность,
	|	Свойства.КвалификаторыЧисла_Неотрицательное КАК КвалификаторыЧисла_Неотрицательное,
	|	Свойства.КвалификаторыСтроки_Длина КАК КвалификаторыСтроки_Длина,
	|	Свойства.КвалификаторыСтроки_Фиксированная КАК КвалификаторыСтроки_Фиксированная,
	|	Свойства.КвалификаторыДаты_Состав КАК КвалификаторыДаты_Состав,
	|	Свойства.ТипыСтрокой КАК ТипыСтрокой,
	|	СвойстваТипы.Тип КАК Тип,
	|	Объекты.Тип КАК ТипОбъекта,
	|	ВТТипОбъекта2ТипДанных.ТипДанных КАК ТипДанных,
	|	ВТПриоритетыТипаЗначений.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТВсеТипыСвойствОбъекта
	|ИЗ
	|	Справочник.Свойства КАК Свойства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Свойства.Типы КАК СвойстваТипы
	|		ПО Свойства.Ссылка = СвойстваТипы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Объекты КАК Объекты
	|		ПО СвойстваТипы.Тип = Объекты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТипОбъекта2ТипДанных КАК ВТТипОбъекта2ТипДанных
	|		ПО Объекты.Тип = ВТТипОбъекта2ТипДанных.ТипОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПриоритетыТипаЗначений КАК ВТПриоритетыТипаЗначений
	|		ПО ВТТипОбъекта2ТипДанных.ТипДанных = ВТПриоритетыТипаЗначений.Ссылка
	|ГДЕ
	|	Свойства.Владелец = &ОбъектКонфигурации
	|	И Свойства.ЭтоГруппа = ЛОЖЬ
	|	И Свойства.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Свойства.Ссылка,
	|	Свойства.Родитель,
	|	Свойства.Наименование,
	|	Свойства.Синоним,
	|	Свойства.Вид,
	|	Свойства.КвалификаторыЧисла_Длина,
	|	Свойства.КвалификаторыЧисла_Точность,
	|	Свойства.КвалификаторыЧисла_Неотрицательное,
	|	Свойства.КвалификаторыСтроки_Длина,
	|	Свойства.КвалификаторыСтроки_Фиксированная,
	|	Свойства.КвалификаторыДаты_Состав,
	|	Свойства.ТипыСтрокой,
	|	СвойстваТипы.Тип,
	|	Объекты.Тип,
	|	ВТТипОбъекта2ТипДанных.ТипДанных,
	|	ВТПриоритетыТипаЗначений.Приоритет
	|ИЗ
	|	Справочник.Свойства КАК Свойства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Свойства.Типы КАК СвойстваТипы
	|		ПО Свойства.Ссылка = СвойстваТипы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Объекты КАК Объекты
	|		ПО СвойстваТипы.Тип = Объекты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТипОбъекта2ТипДанных КАК ВТТипОбъекта2ТипДанных
	|		ПО Объекты.Тип = ВТТипОбъекта2ТипДанных.ТипОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПриоритетыТипаЗначений КАК ВТПриоритетыТипаЗначений
	|		ПО ВТТипОбъекта2ТипДанных.ТипДанных = ВТПриоритетыТипаЗначений.Ссылка
	|ГДЕ
	|	Свойства.Родитель = &ОбъектКонфигурации
	|	И Свойства.ЭтоГруппа = ЛОЖЬ
	|	И Свойства.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.Ссылка КАК Ссылка,
	|	Т1.Родитель КАК Родитель,
	|	Т1.Наименование КАК Наименование,
	|	Т1.Синоним КАК Синоним,
	|	Т1.Вид КАК Вид,
	|	Т1.КвалификаторыЧисла_Длина КАК КвалификаторыЧисла_Длина,
	|	Т1.КвалификаторыЧисла_Точность КАК КвалификаторыЧисла_Точность,
	|	Т1.КвалификаторыЧисла_Неотрицательное КАК КвалификаторыЧисла_Неотрицательное,
	|	Т1.КвалификаторыСтроки_Длина КАК КвалификаторыСтроки_Длина,
	|	Т1.КвалификаторыСтроки_Фиксированная КАК КвалификаторыСтроки_Фиксированная,
	|	Т1.КвалификаторыДаты_Состав КАК КвалификаторыДаты_Состав,
	|	Т1.ТипыСтрокой КАК ТипыСтрокой,
	|	Т1.Тип КАК Тип,
	|	Т1.ТипОбъекта КАК ТипОбъекта,
	|	Т1.ТипДанных КАК ТипДанных,
	|	Т1.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТТипыСвойствОбъекта
	|ИЗ
	|	ВТВсеТипыСвойствОбъекта КАК Т1
	|ГДЕ
	|	Т1.Приоритет В
	|		(ВЫБРАТЬ
	|			МИНИМУМ(Т2.Приоритет)
	|		ИЗ
	|			ВТВсеТипыСвойствОбъекта КАК Т2
	|		ГДЕ
	|			Т2.Ссылка = Т1.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТСвойстваСоставногоТипа
	|ИЗ
	|	ВТТипыСвойствОбъекта КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Ссылка
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(Т.Тип) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т1.Ссылка КАК Ссылка,
	|	Т1.Родитель КАК Родитель,
	|	Т1.Наименование КАК Наименование,
	|	Т1.Синоним КАК Синоним,
	|	Т1.Вид КАК Вид,
	|	Т1.КвалификаторыЧисла_Длина КАК КвалификаторыЧисла_Длина,
	|	Т1.КвалификаторыЧисла_Точность КАК КвалификаторыЧисла_Точность,
	|	Т1.КвалификаторыЧисла_Неотрицательное КАК КвалификаторыЧисла_Неотрицательное,
	|	Т1.КвалификаторыСтроки_Длина КАК КвалификаторыСтроки_Длина,
	|	Т1.КвалификаторыСтроки_Фиксированная КАК КвалификаторыСтроки_Фиксированная,
	|	Т1.КвалификаторыДаты_Состав КАК КвалификаторыДаты_Состав,
	|	ВЫРАЗИТЬ(Т1.ТипыСтрокой КАК СТРОКА(1000)) КАК ТипыСтрокой,
	|	ВЫБОР
	|		КОГДА Т2.Ссылка ЕСТЬ NULL
	|			ТОГДА Т1.Тип
	|	КОНЕЦ КАК ОсновнойТип,
	|	ВЫБОР
	|		КОГДА Т2.Ссылка ЕСТЬ NULL
	|			ТОГДА Т1.ТипОбъекта
	|	КОНЕЦ КАК ОсновнойТипОбъекта,
	|	Т1.ТипДанных КАК ТипДанных,
	|	Т1.Приоритет КАК Приоритет
	|ИЗ
	|	ВТТипыСвойствОбъекта КАК Т1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТипыСвойствОбъекта КАК Т2
	|		ПО Т1.Ссылка = Т2.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА Т1.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ТабличнаяЧасть)
	|			ТОГДА 4
	|		КОГДА Т1.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.Реквизит)
	|			ТОГДА 3
	|		КОГДА Т1.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.Свойство)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	Т1.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Свойства.Ссылка КАК Ссылка,
	|	Свойства.Наименование КАК Наименование,
	|	Свойства.Синоним КАК Синоним
	|ИЗ
	|	Справочник.Свойства КАК Свойства
	|ГДЕ
	|	Свойства.Владелец = &ОбъектКонфигурации
	|	И Свойства.Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)
	|	И Свойства.ЭтоГруппа = ИСТИНА
	|	И Свойства.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Свойства.Наименование";
	Запрос.УстановитьПараметр("ОбъектКонфигурации", ОбъектКонфигурации);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Реквизиты = Неопределено;
	ТабЧасти = Неопределено;
	Если ТипЗнч(ОбъектКонфигурации) = Тип("СправочникСсылка.Объекты") Тогда
		
		// реквизиты объекта и табличные части 
		ВсеРеквизиты = РезультатЗапроса[РезультатЗапроса.ВГраница()-1].Выгрузить(); // ТаблицаЗначений
		ВсеРеквизиты.Индексы.Добавить("Родитель");
		
		
		// Реквизиты объекта
		Реквизиты = ВсеРеквизиты.Скопировать(Новый Структура("Родитель", Справочники.Свойства.ПустаяСсылка()));
		//@skip-check bsl-legacy-check-expression-type
		Реквизиты.Колонки.Удалить("Родитель");
		
		// Табличные части
		ТабЧасти = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить();
		ТабЧасти.Колонки.Добавить("Реквизиты", Новый ОписаниеТипов("ТаблицаЗначений"));
		// Реквизиты табличных частей
		
		// Добавим сразу реквизиты табличных частей в табличные части 
		Для Каждого ТЧ Из ТабЧасти Цикл
			ТЧ.Реквизиты = ВсеРеквизиты.Скопировать(Новый Структура("Родитель", ТЧ.Ссылка));
			ТЧ.Реквизиты.Колонки.Удалить("Родитель");
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ОбъектКонфигурации) = Тип("СправочникСсылка.Свойства") Тогда
		// реквизиты табличной части 
		Реквизиты = РезультатЗапроса[РезультатЗапроса.ВГраница()-1].Выгрузить(); // ТаблицаЗначений
		//@skip-check bsl-legacy-check-expression-type
		Реквизиты.Колонки.Удалить("Родитель");
		ТабЧасти = Новый Массив;
		
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный тип объекта конфигурации: %1'"), ОбъектКонфигурации);
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Новый Структура("Реквизиты, ТабличныеЧасти", Реквизиты, ТабЧасти);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПеречисленияСпецификации(Спецификация)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Справочник.кфкПеречисленияСпецификации.Ссылка, ОбъектКонфигурации
	|ГДЕ Владелец = &Спецификация И ПометкаУдаления = ЛОЖЬ И ОбъектКонфигурации <> ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ОбъектКонфигурации, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НавигацияПоКолонке(Дерево, ИмяКолонки, Приемник = Неопределено)
	
	Если Приемник = Неопределено Тогда
		Приемник = Новый Соответствие;
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Значение = СтрокаДерева[ИмяКолонки];
		Если ЗначениеЗаполнено(Значение) Тогда
			
			Приемник.Вставить(Значение, СтрокаДерева);
			НавигацияПоКолонке(СтрокаДерева, ИмяКолонки, Приемник);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Приемник;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоСвойств()
	
	Строки = Дерево.ПолучитьЭлементы();
	Строки.Очистить();
	
	Свойства = СвойстваОбъектаКонфигурации(Параметры.ОбъектКонфигурации);
	Реквизиты = Свойства.Реквизиты; // ТаблицаЗначений
	ТабЧасти = Свойства.ТабличныеЧасти; // ТаблицаЗначений
	
	ПеречисленияСпецификации = ПеречисленияСпецификации(Параметры.Спецификация);
	
	ЭлементыТипаДанных = Справочники.кфкТипыДанныхСпецификации.ПодчинныеЭлементы(Параметры.ТипДанных);
	СвойстваТипаДанных = НавигацияПоКолонке(ЭлементыТипаДанных, "ОбъектКонфигурации");
	
	// Реквизиты объекта конфигурации
	Для Каждого Реквизит Из Реквизиты Цикл
		ДобавитьСвойствоВДерево(Строки, Реквизит, СвойстваТипаДанных, ПеречисленияСпецификации);
	КонецЦикла;
	
	// Табличные части объекта конфигурации
	Для Каждого ТабЧасть Из ТабЧасти Цикл
		
		// Если табличная часть уже есть в спецификации, то выводим только те реквизиты, которые еще не добавлены в спецификацию.
		// Если табличная часть не добавлена в спецификацию, то выводим все реквизиты
		Свойство = СвойстваТипаДанных.Получить(ТабЧасть.Ссылка);
		Если Свойство <> Неопределено Тогда
			ТребуетсяВывести = Ложь;
			Для Каждого Реквизит Из ТабЧасть.Реквизиты Цикл
				Если СвойстваТипаДанных.Получить(Реквизит.Ссылка) = Неопределено Тогда
					ТребуетсяВывести = Истина;
				КонецЕсли;
			КонецЦикла;
			Если Не ТребуетсяВывести Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = Строки.Добавить();
		НоваяСтрока.СвойствоКонфигурации = ТабЧасть.Ссылка;
		НоваяСтрока.Свойство = ?(Свойство = Неопределено, Неопределено, Свойство.Код);
		НоваяСтрока.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Массив;
		НоваяСтрока.Ссылка = ?(Свойство = Неопределено, Неопределено, Свойство.Ссылка);
		
		СтрокиТЧ = НоваяСтрока.ПолучитьЭлементы();
		
		// Реквизиты табличной части
		Для Каждого Реквизит Из ТабЧасть.Реквизиты Цикл	
			ДобавитьСвойствоВДерево(СтрокиТЧ, Реквизит, СвойстваТипаДанных, ПеречисленияСпецификации);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСвойствоВДерево(Строки, Реквизит, СвойстваТипаДанных, ПеречисленияСпецификации)
	
	Свойство = СвойстваТипаДанных.Получить(Реквизит.Ссылка);
	Если Свойство <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Строки.Добавить();
	НоваяСтрока.СвойствоКонфигурации = Реквизит.Ссылка;
	НоваяСтрока.СвойствоКонфигурацииНаименование = Реквизит.Наименование;
	НоваяСтрока.СвойствоКонфигурацииСиноним = Реквизит.Синоним;
	НоваяСтрока.ТипСвойстваКонфигурации = Реквизит.ТипыСтрокой;
	НоваяСтрока.ТипОбъекта = Реквизит.ОсновнойТипОбъекта;
	НоваяСтрока.Свойство = ?(Свойство = Неопределено, Неопределено, Свойство.Код); // Неопределено -> Наименование+Синоним
	НоваяСтрока.ТипДанных = Реквизит.ОсновнойТипДанных;
	НоваяСтрока.ФорматДанных = Неопределено;
	НоваяСтрока.Перечисление = Неопределено;
	НоваяСтрока.Минимум = Неопределено;
	НоваяСтрока.Максимум = Неопределено;
	НоваяСтрока.Ссылка = ?(Свойство = Неопределено, Неопределено, Свойство.Ссылка);
	
	Если Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.Строка Тогда
		НоваяСтрока.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Строка;
		НоваяСтрока.Максимум = ?(Реквизит.КвалификаторыСтроки_Длина = 0, Неопределено, Реквизит.КвалификаторыСтроки_Длина);
		
	ИначеЕсли Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.Число Тогда
		НоваяСтрока.ТипДанных =
			?(Реквизит.КвалификаторыЧисла_Неотрицательное И Реквизит.КвалификаторыЧисла_Точность = 0,
			Справочники.кфкТипыЗначенийСпецификации.ЦелоеЧисло, Справочники.кфкТипыЗначенийСпецификации.Число);
		НоваяСтрока.Максимум = Реквизит.КвалификаторыЧисла_Длина;
		
	ИначеЕсли Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.Булево Тогда
		НоваяСтрока.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Логический;
		
	ИначеЕсли Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.Дата Тогда
		НоваяСтрока.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Строка;
		НоваяСтрока.ФорматДанных = ?(СокрЛП(НРег(Реквизит.КвалификаторыДаты_Состав)) = "дата",
			Справочники.кфкТипыЗначенийСпецификации.Дата, Справочники.кфкТипыЗначенийСпецификации.ДатаВремя);
		
	ИначеЕсли Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.ХранилищеЗначения Тогда
		НоваяСтрока.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Строка;
		НоваяСтрока.ФорматДанных = Справочники.кфкТипыЗначенийСпецификации.ДанныеBase64;
		
	ИначеЕсли Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.УникальныйИдентификатор Тогда
		НоваяСтрока.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Строка;
		НоваяСтрока.ФорматДанных = Справочники.кфкТипыЗначенийСпецификации.УникальныйИдентификатор;
		
	ИначеЕсли Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.Перечисление Тогда
		НоваяСтрока.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Строка;
		НоваяСтрока.Перечисление = ПеречисленияСпецификации.Получить(Реквизит.ОсновнойТип);
		Если Не ЗначениеЗаполнено(НоваяСтрока.Перечисление) Тогда
			НоваяСтрока.Перечисление = Реквизит.ОсновнойТип;
		КонецЕсли;
		
	ИначеЕсли Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.ЛюбаяСсылка
			Или Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.Справочник
			Или Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.Документ
			Или Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовХарактеристик
			Или Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.ПланСчетов
			Или Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовРасчета
			Или Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.ПланОбмена
			Или Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.БизнесПроцесс
			Или Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.Задача
			Или Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.ТочкаМаршрутаБизнесПроцесса
			Или Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.ВидРасчета
			Или Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.ВидСубконто
			Или Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.ПланОбмена
			Или Реквизит.ОсновнойТипОбъекта = Перечисления.ТипыОбъектов.ПланОбмена
			Тогда
		НоваяСтрока.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Строка;
		НоваяСтрока.ФорматДанных = Справочники.кфкТипыЗначенийСпецификации.УникальныйИдентификатор;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьСвойстваНаСервере()
	
	ДеревоСвойств = РеквизитФормыВЗначение("Дерево");
	Возврат Справочники.кфкТипыДанныхСпецификации.СоздатьСвойства(
		Параметры.Спецификация, Параметры.ТипДанных, ДеревоСвойств);
	
КонецФункции

#КонецОбласти
