
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура кфкПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элемент = Элементы.Вставить("кфкИмяEN", Тип("ПолеФормы"), Элементы.ГруппаШапкаСлева, Элементы.Синоним);
	Элемент.ПутьКДанным = "Объект.кфкИмяEN";
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	
	Элемент = Элементы.Добавить("кфкПроверкаЗаполнения", Тип("ПолеФормы"), Элементы.ГруппаШапкаСлева);
	Элемент.ПутьКДанным = "Объект.кфкПроверкаЗаполнения";
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры

#КонецОбласти
