
#Область СлужебныеПроцедурыИФункции

//@skip-check change-and-validate-instead-of-around
&Вместо("ПроверитьНеобходимостьЗаполненияПКО")
&НаСервере
Функция кфкПроверитьНеобходимостьЗаполненияПКО()
	Возврат Ложь;
КонецФункции

&ИзменениеИКонтроль("ЗаполнитьТаблицыСвойств")
&НаСервере
Процедура кфкЗаполнитьТаблицыСвойств()
	#Удаление
	ДанныеПКО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "ОбъектКонфигурации, ОбъектФормата, ОбъектКонфигурацииКорреспондент");
	КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствКонфигурации(ТаблицаСвойствКонфигурации,
			Объект.Владелец,
			ДанныеПКО.ОбъектКонфигурации,
			Новый Структура("ЭтоГруппа, Родитель", Ложь, ГруппаСвойствКонфигурации));
	#КонецУдаления
	#Вставка
	ДанныеПКО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "ОбъектКонфигурации, кфкТабличнаяЧасть, ОбъектФормата, ОбъектКонфигурацииКорреспондент");
	Если ГруппаСвойствКонфигурации.Пустая() И ЗначениеЗаполнено(ДанныеПКО.кфкТабличнаяЧасть) Тогда
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствКонфигурации(ТаблицаСвойствКонфигурации,
			Объект.Владелец,
			ДанныеПКО.ОбъектКонфигурации,
			Новый Структура("ЭтоГруппа, Родитель", Ложь, ДанныеПКО.кфкТабличнаяЧасть));
		Для Каждого Строка Из ТаблицаСвойствКонфигурации Цикл
			Строка.Имя = СтрРазделить(Строка.Имя, ".")[1];
		КонецЦикла;
	Иначе
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствКонфигурации(ТаблицаСвойствКонфигурации,
			Объект.Владелец,
			ДанныеПКО.ОбъектКонфигурации,
			Новый Структура("ЭтоГруппа, Родитель", Ложь, ГруппаСвойствКонфигурации));
		
	КонецЕсли;
	#КонецВставки
	Если ЭтоКонвертацияXDTO Тогда
		ФильтрСвойствФормата = Новый Структура("ОбъектФормата, ЭтоГруппа, Родитель",  ДанныеПКО.ОбъектФормата, Ложь, ГруппаСвойствФормата);
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствФормата(ТаблицаСвойствФормата,
				Объект.Владелец,
				ФильтрСвойствФормата);
	Иначе
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствКонфигурации(ТаблицаСвойствКонфигурацииКорреспондент,
			Объект.Владелец,
			ДанныеПКО.ОбъектКонфигурацииКорреспондент,
			Новый Структура("ЭтоГруппа, Родитель, Корреспондент", Ложь, ГруппаСвойствКонфигурацииКорреспондент, Истина));

	КонецЕсли;
КонецПроцедуры
#КонецОбласти
