
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура кфкЗаполнитьИдентификаторПосле(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ОбъектКонфигурации) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Код = кфкПолучитьИдентификатор(Объект.ОбъектКонфигурации, Объект.ГруппаПравил);
	
	Если Не (Объект.ИспользоватьДляОтправки И Объект.ИспользоватьДляПолучения) Тогда
		Объект.Код = Объект.Код + ?(Объект.ИспользоватьДляПолучения, "_Получение", "_Отправка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция кфкПолучитьИдентификатор(ОбъектКонфигурации, Группа)
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Объекты.Имя КАК Имя,
	|	Объекты.Тип КАК Тип,
	|	ПРЕДСТАВЛЕНИЕ(Объекты.Родитель) КАК Группа
	|ИЗ
	|	Справочник.Объекты КАК Объекты
	|ГДЕ
	|	Объекты.Ссылка = &Объект";
	Запрос.УстановитьПараметр("Объект", ОбъектКонфигурации);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Группа = Выборка.Группа;
		
		ЧастиИмени = СтрРазделить(Выборка.Имя, "_", Ложь);
		Результат = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.Тип) + "_" + ЧастиИмени[ЧастиИмени.ВГраница()];
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
