#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПослеЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий)
	
//	РегистрыСведений.кфкИзмененияОбъектовСпецификаций.ОбработкаЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВидПовышения(Данные, История, ЭтоНовый) Экспорт
	
	ВидыПовышения = Перечисления.кфкВидыПовышенияВерсий;
	Если ТипЗнч(История) = Тип("ИнформацияОЗаписиВерсииИсторииДанных") Тогда
		Возврат кфкРаботаСоСпецификациями.ПолучитьИндексСобытия(
			История, ЭтоНовый, ВидыПовышения.ДополняющаяВерсия, ВидыПовышения.ОсновнаяВерсия);
	КонецЕсли;
	
	РезультатыКлассификации = Новый Массив;
	Для Каждого КлючЗначение Из История Цикл
		ИмяРеквизита = КлючЗначение.Ключ;
		Изменения = КлючЗначение.Значение;

		Если ИмяРеквизита = "ПометкаУдаления" Тогда
			ВидПовышения = ?(Изменения.ЗначениеПослеИзменения,
				ВидыПовышения.ДополняющаяВерсия, ВидыПовышения.ВерсияИсправления);
			РезультатыКлассификации.Очистить();
			РезультатыКлассификации.Добавить(ВидПовышения);
			Прервать;
		ИначеЕсли ИмяРеквизита = "Наименование" Тогда
			ВидПовышения = ВидыПовышения.ВерсияИсправления;
		Иначе
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Неизвестное имя реквизита: %1'"), ИмяРеквизита);
		КонецЕсли;
		
		РезультатыКлассификации.Добавить(ВидПовышения);
	КонецЦикла;
	
	Возврат кфкРаботаСоСпецификациями.ПолучитьИндексИзменений(
		РезультатыКлассификации);
	
КонецФункции

#КонецОбласти

#КонецЕсли
