#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Текст = Обработки.кфкЗаполнениеИменПолейСпецификации.ПолучитьМакет("Контекст").ПолучитьТекст();
	Контекст.УстановитьТекст(Текст);
	 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьОписаниеМетаданных(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	АдресОписания = ОписаниеМетаданных(Релиз);
	Если АдресОписания = Неопределено Тогда
		ПоказатьПредупреждение(, "Все имена уже заполнены. Выгружать нечего.");
		Возврат;
	КонецЕсли;
	
	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохранения.Диалог.Фильтр = "Описание метаданных (*.json)|*.json";

	ФайловаяСистемаКлиент.СохранитьФайл(
		Неопределено,
		АдресОписания,
		НСтр("ru = 'Описание метаданных.json'"),
		ПараметрыСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИменаСпецификации(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИменаСпецификацииЗавершение", ЭтотОбъект);
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.Диалог.Фильтр = "Описание метаданных (*.json)|*.json";
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение, ПараметрыЗагрузки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьИменаСпецификацииЗавершение(ПомещенныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИменаСпецификацииНаСервере(ПомещенныйФайл.Хранение)
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписаниеМетаданных(Релиз)
	
	ОписаниеМетаданных = Обработки.кфкЗаполнениеИменПолейСпецификации.ОписаниеМетаданных(Релиз);
	Если ОписаниеМетаданных.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Поток = Новый ПотокВПамяти;
	
	Запрос = Новый HTTPЗапрос;
	Запрос.УстановитьТелоИзСтроки(ОбщегоНазначения.ЗначениеВJSON(ОписаниеМетаданных));
	ДвоичныеДанные = Запрос.ПолучитьТелоКакДвоичныеДанные();
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
КонецФункции

&НаСервереБезКонтекста
Процедура ЗагрузитьИменаСпецификацииНаСервере(Хранение)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Хранение); // ДвоичныеДанные
	Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
	
	ЧтениеТекста = Новый ЧтениеТекста();
	ЧтениеТекста.Открыть(Поток, КодировкаТекста.UTF8);
	СтрокаJSON = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	Поток.Закрыть();
	
	Описание = ОбщегоНазначения.JSONВЗначение(СтрокаJSON);
	
	Обработки.кфкЗаполнениеИменПолейСпецификации.ЗагрузитьИменаСпецификации(Описание);
	
КонецПроцедуры

#КонецОбласти
