//@skip-check export-procedure-missing-comment

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

&ИзменениеИКонтроль("ВыполнитьВыгрузкуМодулей")
Функция кфкВыполнитьВыгрузкуМодулей() Экспорт

	МенеджерТеги = Справочники.Теги;

	ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Конвертация, "Конфигурация, ИспользоватьРазделениеМодуля, ИспользоватьТипизациюПеременных, ГруппироватьПоОбъектамВыгрузки, ЗапретитьПереводИменОбъектовФормата");
	Модули = Новый ТаблицаЗначений;
	Если ДанныеКонвертации.ИспользоватьРазделениеМодуля Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Ссылка,
		|	Наименование,
		|	Раздел,
		|	ВЫБОР
		|		КОГДА Раздел = ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.Базисный)
		|			ТОГДА 4
		|		КОГДА Раздел = ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.Алгоритмы)
		|			ТОГДА 1
		|		КОГДА Раздел = ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.Пользовательский)
		|			ТОГДА 3
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Сортировка,
		|	ЛОЖЬ КАК ЕстьПроцедурыВызоваОбработчика,
		|	ЛОЖЬ КАК ЕстьФункцииВызоваОбработчика,
		|	ЛОЖЬ КАК ЭтоМодульМенеджера,
		|	"""" КАК ИмяПапки
		|ИЗ
		|	Справочник.ДополнительныеМодули
		|ГДЕ
		|	Владелец = &Конвертация
		|	И НЕ ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сортировка,
		|	Наименование";
		Запрос.УстановитьПараметр("Конвертация", Конвертация);
		Модули = Запрос.Выполнить().Выгрузить();
		Модули.Колонки.Добавить("ТекстМодуля");
	КонецЕсли;

	// Вычисляем признак добавления тегов.
	Релиз = ДанныеКонвертации.Конфигурация;
	Конфигурация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Релиз, "КонфигурацияВладелец");
	ВыборкаТеги = Справочники.Теги.Выбрать(,Конфигурация);
	ДобавлятьТеги = Ложь;
	СхлопываниеТегов = Новый Массив;
	МаксимальнаяДлинаТега = 0;
	ВсеТеги = Новый Массив;
	Пока ВыборкаТеги.Следующий() Цикл
		ДобавлятьТеги = Истина;
		ТекТег = СокрЛП(ВыборкаТеги.Наименование);
		СтрСхлопывание = "//-- " + ТекТег + Символы.ПС + "//++ " + ТекТег;
		СхлопываниеТегов.Добавить(СтрСхлопывание);
		СтрСхлопывание = Символы.Таб + "//-- " + ТекТег + Символы.ПС + Символы.Таб + "//++ " + ТекТег;
		СхлопываниеТегов.Добавить(СтрСхлопывание);
		СтрСхлопывание = Символы.Таб + Символы.Таб + "//-- " + ТекТег + Символы.ПС + Символы.Таб + Символы.Таб + "//++ " + ТекТег;
		СхлопываниеТегов.Добавить(СтрСхлопывание);
		ДлинаТега = СтрЧислоСтрок(СтрСхлопывание);
		Если ДлинаТега > МаксимальнаяДлинаТега Тогда
			МаксимальнаяДлинаТега = ДлинаТега;
		КонецЕсли;
		ВсеТеги.Добавить(ТекТег);
	КонецЦикла;

	РасширенныеТегиМодуля = МенеджерТеги.ПолучитьРасширенныеТегиПоВладельцу(Конфигурация);

	ПараметрыМодуля = Новый Структура("Релиз, Конфигурация, ДобавлятьТеги, ИспользоватьРазделениеМодуля",
		Релиз, Конфигурация, ДобавлятьТеги, ДанныеКонвертации.ИспользоватьРазделениеМодуля);
	ПараметрыМодуля.Вставить("ИспользоватьТипизациюПеременных", ДанныеКонвертации.ИспользоватьТипизациюПеременных);
	ПараметрыМодуля.Вставить("ГруппироватьПоОбъектамВыгрузки", ДанныеКонвертации.ГруппироватьПоОбъектамВыгрузки);
	МакетТекстовМодулей = ПолучитьМакет("ШаблоныТекстовМодулей");
	МакетТекстовМодулейДетализацияКомментариев = ПолучитьМакет("ШаблоныДетализацииКомментариев");
	ПараметрыМодуля.Вставить("МакетТекстовМодулей", МакетТекстовМодулей);
	ПараметрыМодуля.Вставить("МакетТекстовМодулейДетализацияКомментариев", МакетТекстовМодулейДетализацияКомментариев);
	ПараметрыМодуля.Вставить("ТекстПроцедурыВызоваОбработчика", "");
	ПараметрыМодуля.Вставить("ТекстФункцииВызоваОбработчика", "");
	ПараметрыМодуля.Вставить("ПрограммныйИнтерфейс", Новый ТекстовыйДокумент);

	// Параметры тегов
	ПараметрыМодуля.Вставить("СхлопываниеТегов",		СхлопываниеТегов);
	ПараметрыМодуля.Вставить("МаксимальнаяДлинаТега",	МаксимальнаяДлинаТега);
	ПараметрыМодуля.Вставить("РасширенныеТегиМодуля",	РасширенныеТегиМодуля);
	ПараметрыМодуля.Вставить("МаксимальнаяДлинаРасширенногоТега", 0);
	ПараметрыМодуля.Вставить("ВсеТеги",					ВсеТеги);
	//

	ПараметрыМодуля.Вставить("ЗапретитьПереводИменОбъектовФормата", ДанныеКонвертации.ЗапретитьПереводИменОбъектовФормата);
	ПараметрыМодуля.Вставить("ВерсияФорматаМенеджера", КонвертацияДанныхXDTOСервер.ВерсияФорматаМенеджераОбмена(Конвертация, Истина));

	// Заполнение таблиц правил ПОД, ПКО
	ПараметрыМодуля.Вставить("ПОД_Отправка", Новый ТекстовыйДокумент);
	ПараметрыМодуля.Вставить("ПОД_Получение", Новый ТекстовыйДокумент);
	ПараметрыМодуля.Вставить("ПКО_Отправка", Новый ТекстовыйДокумент);
	ПараметрыМодуля.Вставить("ПКО_Получение", Новый ТекстовыйДокумент);
	ПараметрыМодуля.Вставить("ПКО_ОтправкаИПолучение", Новый ТекстовыйДокумент);

	Если ДанныеКонвертации.ИспользоватьРазделениеМодуля Тогда
		ПараметрыМодуля.Вставить("Модули", Модули);

		Результат = Новый Структура;
		МодульАлгоритмы = Неопределено;
		Для Каждого СтрМодуль Из Модули Цикл
			Если СтрМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.Базисный Тогда
				// Перед базисным модулем надо заполнить модули менеджера.
				ЗаполнитьМодулиМенеджеров(Результат, ПараметрыМодуля);
				// Базисный модуль.
				ЗаполнитьБазисныйМодуль(СтрМодуль, ПараметрыМодуля);
			ИначеЕсли СтрМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.Алгоритмы Тогда
				// Обработается позднее.
				МодульАлгоритмы = СтрМодуль;
			ИначеЕсли СтрМодуль.ЭтоМодульМенеджера Тогда
				// Дополнительный модуль с выгрузкой в модуль менеджера уже обработан.
				Продолжить;
			Иначе
				ЗаполнитьДополнительныйМодуль_Правила(СтрМодуль, ПараметрыМодуля);
			КонецЕсли;
		КонецЦикла;
		// Модуль Алгоритмы заполняется после всех других модулей, т.к. сначала должны быть заполнены возможные условия применения.
		Если МодульАлгоритмы <> Неопределено Тогда
			ЗаполнитьДополнительныйМодуль_Алгоритмы(МодульАлгоритмы, ПараметрыМодуля);
		КонецЕсли;
		// Замена вызовов алгоритмов после заполнения всех модулей.
		Для Каждого СтрМодуль Из Модули Цикл
			ОбщийТекстМодуля = СтрМодуль.ТекстМодуля;
			Если СтрМодуль.Раздел <> Перечисления.РазделыДополнительныхМодулей.Алгоритмы Тогда
				ПараметрыМодуля.Вставить("ТекущийМодуль", СтрМодуль);
				ЗаменитьВызовыАлгоритмов(ПараметрыМодуля, ОбщийТекстМодуля);
			КонецЕсли;
			Если СтрМодуль.ЭтоМодульМенеджера Тогда
				// Имя модуля в результирующей структуре
				ИмяМодуляДляВозврата = СтрЗаменить(СокрЛП(СтрМодуль.Наименование), ".", "_");
			Иначе
				ИмяМодуляДляВозврата = СокрЛП(СтрМодуль.Наименование);
			КонецЕсли;
			// Удаление идентичных тегов закрытие + открытие
			ОбщийТекстМодуляСтрокой = ОбщийТекстМодуля.ПолучитьТекст();
			ВыполнитьСхлопываниеТеговВМодуле(ПараметрыМодуля, ОбщийТекстМодуляСтрокой);
			Результат.Вставить(ИмяМодуляДляВозврата, ОбщийТекстМодуляСтрокой);
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;

	ОбщийТекстМодуля = Новый ТекстовыйДокумент;
	ДобавитьЗаголовокМодуля(ОбщийТекстМодуля);

	ТекстыПоГруппам = Новый Структура;
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункции", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункции_ПОД", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункцииПоГруппам_ПОД", Новый Структура);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункции_ПКО", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункцииПоГруппам_ПКО", Новый Структура);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункцииПоГруппам", Новый Структура);

	ТекстыПоГруппам.Вставить("ОбработчикиКонвертации", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("ОбработчикиКонвертацииПоГруппам", Новый Структура);


	ТекстПроцедуры_Конвертация = ЗаполнитьТекстПроцедурыКонвертации(ПараметрыМодуля, МакетТекстовМодулей);
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку("#Область ПроцедурыКонвертации");
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку(ТекстПроцедуры_Конвертация);
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку("#КонецОбласти");
	ВерсияФорматаМенеджераТекст = ПолучитьВерсиюФорматаМенеджера(ПараметрыМодуля, МакетТекстовМодулей);

	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку(ВерсияФорматаМенеджераТекст);

	ЗаполнитьТекстПроцедурыПОД(ТекстыПоГруппам, ПараметрыМодуля);

	ЗаполнитьТекстПроцедурыПКО(ТекстыПоГруппам, ПараметрыМодуля);

	ДобавитьПроцедурыПОДиПКОВМодуль(ПараметрыМодуля);

	ЗаполнитьТекстПроцедурыПКПД(ПараметрыМодуля);

	ЗаполнитьТекстПроцедурыАлгоритмы(ТекстыПоГруппам, ПараметрыМодуля);

	ЗаполнитьТекстПроцедурыПараметры(ПараметрыМодуля, ПараметрыМодуля.ПрограммныйИнтерфейс);

	ЗаполнитьТекстПроцедурыВызоваОбработчиков(ПараметрыМодуля);

	ДобавитьПроцедурыВТекстМодуля(ОбщийТекстМодуля, ТекстыПоГруппам, ПараметрыМодуля);

	Стр = ОбщийТекстМодуля.ПолучитьТекст();
	// Удаление идентичных тегов закрытие + открытие
	ВыполнитьСхлопываниеТеговВМодуле(ПараметрыМодуля, Стр);

	#Вставка
	Стр = "//@skip-check undefined-variable
		|
		|" + Стр;
	Стр = СтрЗаменить(Стр, "ОбменДаннымиXDTOСервер", "кфкОбменДаннымиXDTOСервер");
	// фикс
	Стр = СтрЗаменить(Стр, "ИспользованиеПКО - Массив из Строка", "ИспользованиеПКО - Структура");
	#КонецВставки
	ОбщийТекстМодуля.УстановитьТекст(Стр);

	Возврат Новый Структура("МенеджерОбменаЧерезУниверсальныйФормат", ОбщийТекстМодуля);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеТекстаМодулей

&ИзменениеИКонтроль("ПолучитьВерсиюФорматаМенеджера")
Функция кфкПолучитьВерсиюФорматаМенеджера(ОбщиеПеременные, МакетТекстовМодулей)
	ВерсияФорматаМенеджераТекст = МакетТекстовМодулей.ПолучитьОбласть("ВерсияФорматаМенеджераОбмена").ПолучитьТекст();
	ВерсияФорматаМенеджераТекст = СтрЗаменить(ВерсияФорматаМенеджераТекст,
		"#Область ВерсияФорматаМенеджераОбмена" + Символы.ПС, "");
	#Удаление
	ВерсияФорматаМенеджераТекст = СтрЗаменить(ВерсияФорматаМенеджераТекст, "&ВерсияФорматаМенеджераОбмена",
									"""" + СокрЛП(ОбщиеПеременные.ВерсияФорматаМенеджера) + """");
	#КонецУдаления
	#Вставка
	ВерсияФорматаМенеджера = СокрЛП(ОбщиеПеременные.ВерсияФорматаМенеджера);
	Если ВерсияФорматаМенеджера = "2" Тогда
		ВерсияФорматаМенеджера = ВерсияФорматаМенеджера + ".КФК";
	КонецЕсли;
	ВерсияФорматаМенеджераТекст = СтрЗаменить(ВерсияФорматаМенеджераТекст, "&ВерсияФорматаМенеджераОбмена",
									"""" + ВерсияФорматаМенеджера + """");
	#КонецВставки
	Возврат ВерсияФорматаМенеджераТекст;
КонецФункции

&ИзменениеИКонтроль("ЗаполнитьТекстПроцедурыКонвертации")
Функция кфкЗаполнитьТекстПроцедурыКонвертации(ПараметрыМодуля, МакетТекстовМодулей)

	ТекстПроцедуры = Новый ТекстовыйДокумент;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Конвертации.АлгоритмПередКонвертацией КАК АлгоритмПередКонвертацией,
	|	Конвертации.АлгоритмПослеКонвертации КАК АлгоритмПослеКонвертации,
	|	Конвертации.АлгоритмПередОбработкойУдаления КАК АлгоритмПередОбработкойУдаления,
	|	Конвертации.АлгоритмПередОтложеннымЗаполнением КАК АлгоритмПередОтложеннымЗаполнением
	|ИЗ
	|	Справочник.Конвертации КАК Конвертации
	|ГДЕ
	|	Конвертации.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Конвертация);

	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ПередКонвертациейЗаголовок = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПередКонвертацией_Заголовок").ПолучитьТекст();
	ПередКонвертациейЗаголовок = СтрЗаменить(ПередКонвертациейЗаголовок,"#Область Конвертация_ПередКонвертацией_Заголовок", "---");
	#Вставка
	ПередКонвертациейЗаголовок = СтрЗаменить(ПередКонвертациейЗаголовок, "(КомпонентыОбмена)", "(КомпонентыОбмена, ДанныеИБ)");
	ПередКонвертациейЗаголовок = СтрЗаменить(ПередКонвертациейЗаголовок, "ИнициализироватьКомпонентыОбмена", "ИнициализироватьКомпонентыОбмена
	|//  ДанныеИБ - СправочникОбъект, ДокументОбъект, Структура - выгружаемые данные ИБ");
	#КонецВставки
	УдалитьПоследнийПереводСтроки(ПередКонвертациейЗаголовок);
	ТекстПроцедуры.ДобавитьСтроку(ПередКонвертациейЗаголовок);
	Если ЗначениеЗаполнено(Выборка.АлгоритмПередКонвертацией) Тогда
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.АлгоритмПередКонвертацией));
	КонецЕсли;
	Если ПараметрыМодуля.ВерсияФорматаМенеджера >= 3 Тогда
		// Инициализация условий применения правил.
		ТекстЗаполнениеУсловий = ЗаполнитьИспользуемыеУсловияПримененияПравил(ПараметрыМодуля);
		Если НЕ ПустаяСтрока(ТекстЗаполнениеУсловий) Тогда
			ТекстИнициализацияУсловий = МакетТекстовМодулей.ПолучитьОбласть("Служебные_ИнициализацияУсловийПримененияПравил").ПолучитьТекст();
			ТекстИнициализацияУсловий = СтрЗаменить(ТекстИнициализацияУсловий,"#Область Служебные_ИнициализацияУсловийПримененияПравил", "---");
			ТекстИнициализацияУсловий = "#Область ИнициализацияУсловийПримененияПравил" + Символы.ПС + ТекстИнициализацияУсловий + "#КонецОбласти";
			ТекстИнициализацияУсловий = СтрЗаменить(ТекстИнициализацияУсловий, "&ЗаполнениеУсловийПрименения", ТекстЗаполнениеУсловий);
			ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(ТекстИнициализацияУсловий));
		КонецЕсли;
	КонецЕсли;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");
	ТекстПроцедуры.ДобавитьСтроку("");

	ПослеКонвертацииЗаголовок = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПослеКонвертации_Заголовок").ПолучитьТекст();
	ПослеКонвертацииЗаголовок = СтрЗаменить(ПослеКонвертацииЗаголовок,"#Область Конвертация_ПослеКонвертации_Заголовок", "---");
	#Вставка
	ПослеКонвертацииЗаголовок = СтрЗаменить(ПослеКонвертацииЗаголовок, "(КомпонентыОбмена)", "(КомпонентыОбмена, ДанныеИБ, Сообщение)");
	ПослеКонвертацииЗаголовок = СтрЗаменить(ПослеКонвертацииЗаголовок, "ИнициализироватьКомпонентыОбмена", "ИнициализироватьКомпонентыОбмена
	|//   ДанныеИБ - СправочникОбъект, ДокументОбъект, Структура - выгружаемые данные ИБ
	|//   Сообщение - Структура - сформированное сообщение");
	#КонецВставки
	УдалитьПоследнийПереводСтроки(ПослеКонвертацииЗаголовок);
	ТекстПроцедуры.ДобавитьСтроку(ПослеКонвертацииЗаголовок);
	Если ЗначениеЗаполнено(Выборка.АлгоритмПослеКонвертации) Тогда
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.АлгоритмПослеКонвертации));
	КонецЕсли;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");
	ТекстПроцедуры.ДобавитьСтроку("");

	ПередОтложеннымЗаполнениемЗаголовок = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПередОтложеннымЗаполнением_Заголовок").ПолучитьТекст();
	ПередОтложеннымЗаполнениемЗаголовок = СтрЗаменить(ПередОтложеннымЗаполнениемЗаголовок,"#Область Конвертация_ПередОтложеннымЗаполнением_Заголовок", "---");
	УдалитьПоследнийПереводСтроки(ПередОтложеннымЗаполнениемЗаголовок);
	ТекстПроцедуры.ДобавитьСтроку(ПередОтложеннымЗаполнениемЗаголовок);
	Если ЗначениеЗаполнено(Выборка.АлгоритмПередОтложеннымЗаполнением) Тогда
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.АлгоритмПередОтложеннымЗаполнением));
	КонецЕсли;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");

	#Удаление
	ПередУдалениемЗаголовок = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПередОбработкойУдаления_Заголовок").ПолучитьТекст();
	ПередУдалениемЗаголовок = СтрЗаменить(ПередУдалениемЗаголовок,"#Область Конвертация_ПередОбработкойУдаления_Заголовок", "");
	УдалитьПоследнийПереводСтроки(ПередУдалениемЗаголовок);
	ТекстПроцедуры.ДобавитьСтроку(ПередУдалениемЗаголовок);
	Если ЗначениеЗаполнено(Выборка.АлгоритмПередОбработкойУдаления) Тогда
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.АлгоритмПередОбработкойУдаления));
	КонецЕсли;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");
	#КонецУдаления

	Возврат ТекстПроцедуры.ПолучитьТекст();

КонецФункции

&ИзменениеИКонтроль("ДобавитьПроцедурыВТекстМодуля")
Процедура кфкДобавитьПроцедурыВТекстМодуля(ОбщийТекстМодуля, ТекстыПоГруппам, ПараметрыМодуля, ЭтоМодульМенеджера)
	Если НЕ ПараметрыМодуля.ИспользоватьРазделениеМодуля Тогда
		ОбщийТекстМодуля.ДобавитьСтроку("#Область СлужебныйПрограммныйИнтерфейс");
		ОбщийТекстМодуля.ДобавитьСтроку(ПараметрыМодуля.ПрограммныйИнтерфейс.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти"); // СлужебныйПрограммныйИнтерфейс
	КонецЕсли;
	Если НЕ ЭтоМодульМенеджера Тогда
		ОбщийТекстМодуля.ДобавитьСтроку("#Область СлужебныеПроцедурыИФункции");
	КонецЕсли;
	Если НЕ (ПараметрыМодуля.ИспользоватьРазделениеМодуля И ПараметрыМодуля.ТекущийМодуль.ЭтоМодульМенеджера) Тогда
		ДобавитьУИДМодуля(ОбщийТекстМодуля);
	КонецЕсли;
	ОбщийТекстМодуля.ДобавитьСтроку("#Область ПОД");
	Для Каждого ГруппаПравил Из ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам_ПОД Цикл
		ОбщийТекстМодуля.ДобавитьСтроку("#Область " + ГруппаПравил.Ключ);
		ОбщийТекстМодуля.ДобавитьСтроку(ГруппаПравил.Значение.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	КонецЦикла;
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.СлужебныеПроцедурыИФункции_ПОД.ПолучитьТекст());
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти"); // ПОД

	ОбщийТекстМодуля.ДобавитьСтроку("#Область ПКО");
	Для Каждого ГруппаПравил Из ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам_ПКО Цикл
		ОбщийТекстМодуля.ДобавитьСтроку("#Область " + ГруппаПравил.Ключ);
		ОбщийТекстМодуля.ДобавитьСтроку(ГруппаПравил.Значение.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
		ОбщийТекстМодуля.ДобавитьСтроку("// " + ГруппаПравил.Ключ); // СлужебныйПрограммныйИнтерфейс
	КонецЦикла;
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.СлужебныеПроцедурыИФункции_ПКО.ПолучитьТекст());
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти"); // ПКО
	Для Каждого ГруппаПравил Из ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам Цикл
		// Алгоритмы принудительно добавляем в конец позднее.
		Если  ГруппаПравил.Ключ = "Алгоритмы" Тогда
			Продолжить;
		КонецЕсли;
		ОбщийТекстМодуля.ДобавитьСтроку("#Область " + ГруппаПравил.Ключ);
		ОбщийТекстМодуля.ДобавитьСтроку(ГруппаПравил.Значение.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	КонецЦикла;
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.СлужебныеПроцедурыИФункции.ПолучитьТекст());
	СлужебныеПроцедурыДополнение = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("Служебные_ЗаполнениеПКС").ПолучитьТекст();
	СлужебныеПроцедурыДополнение = СтрЗаменить(СлужебныеПроцедурыДополнение,"#Область Служебные_ЗаполнениеПКС", "");
	Если ПараметрыМодуля.ВерсияФорматаМенеджера >= 3 И ПараметрыМодуля.Свойство("МассивИспользуемыхУсловийПрименения") Тогда
		СлужебныеУсловиеДобавленияПКС = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("Служебные_ПроверкаУсловийПримененияПКС").ПолучитьТекст();
		СлужебныеУсловиеДобавленияПКС = СтрЗаменить(СлужебныеУсловиеДобавленияПКС, "#Область Служебные_ПроверкаУсловийПримененияПКС", "---");
		СлужебныеУсловиеДобавленияПКСДляСвойства = "Если РодительПКС = Неопределено Тогда"
			+ Символы.ПС + Символы.Таб + Символы.Таб + "Возврат;" + Символы.ПС + Символы.Таб + "КонецЕсли;" + Символы.ПС + СлужебныеУсловиеДобавленияПКС;
		СлужебныеПроцедурыДополнение = СтрЗаменить(СлужебныеПроцедурыДополнение, "&ПроверкаУсловийПримененияДляСвойства", СлужебныеУсловиеДобавленияПКСДляСвойства);
		СлужебныеУсловиеДобавленияПКСДляТЧ = СтрЗаменить(СлужебныеУсловиеДобавленияПКС, "Возврат", "Возврат Неопределено");
		СлужебныеПроцедурыДополнение = СтрЗаменить(СлужебныеПроцедурыДополнение, "&ПроверкаУсловийПримененияДляГруппы", СлужебныеУсловиеДобавленияПКСДляТЧ);
		СлужебныеПроцедурыДополнение = СтрЗаменить(СлужебныеПроцедурыДополнение, "&ПараметрУсловиеПрименения", ", УсловиеПрименения = """"");
	Иначе
		СлужебныеПроцедурыДополнение = СтрЗаменить(СлужебныеПроцедурыДополнение, "&ПроверкаУсловийПрименения", "---");
		СлужебныеПроцедурыДополнение = СтрЗаменить(СлужебныеПроцедурыДополнение, "&ПараметрУсловиеПрименения", "");
	КонецЕсли;
	ОбщийТекстМодуля.ДобавитьСтроку(СлужебныеПроцедурыДополнение);
	Если ПараметрыМодуля.ГруппироватьПоОбъектамВыгрузки = Ложь Тогда
		ОбщийТекстМодуля.ДобавитьСтроку("#Область ОбработчикиКонвертации");
		Для Каждого ГруппаПравил Из ТекстыПоГруппам.ОбработчикиКонвертацииПоГруппам Цикл
			ОбщийТекстМодуля.ДобавитьСтроку("#Область " + ГруппаПравил.Ключ);
			ОбщийТекстМодуля.ДобавитьСтроку(ГруппаПравил.Значение.ПолучитьТекст());
			ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
		КонецЦикла;
		ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.ОбработчикиКонвертации.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти"); // ОбработчикиКонвертации
	КонецЕсли;
	// Алгоритмы принудительно добавляем в конец.
	Если (НЕ ПараметрыМодуля.ИспользоватьРазделениеМодуля Или ПараметрыМодуля.ТекущийМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.Пользовательский)
		И ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам.Свойство("Алгоритмы") Тогда
		ОбщийТекстМодуля.ДобавитьСтроку("#Область Алгоритмы");
		ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам.Алгоритмы.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти"); // Алгоритмы
	КонецЕсли;
	#Вставка
	ОбщийТекстМодуля.ДобавитьСтроку(ПолучитьМакет("кфкСлужебныеПроцедурыИФункции").ПолучитьТекст()); // КФК-СлужебныеПроцедурыИФункции
	#КонецВставки
	Если НЕ ЭтоМодульМенеджера Тогда
		// Конец области Служебные процедуры и функции.
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти"); //СлужебныеПроцедурыИФункции
	КонецЕсли;
	УдалитьЛишниеСтрокиИзМодуля(ОбщийТекстМодуля);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
