
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПослеЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий)
	
	РегистрыСведений.кфкИзмененияОбъектовСпецификаций.ОбработкаЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает созданное перечисление спецификации
// 
// Параметры:
//	Спецификация - СправочникСсылка.кфкПеречисленияСпецификации - Спецификация
//	ОбъектКонфигурации - СправочникСсылка.Объекты - Объект конфигурации
//	Наименование - Строка - Наименование перечисления
// 
// Возвращаемое значение:
//	СправочникСсылка.кфкПеречисленияСпецификации - Созданный элемент
Функция Создать(Спецификация, ОбъектКонфигурации, Наименование) Экспорт
	
	Объект = СоздатьЭлемент();
	Объект.Владелец = Спецификация;
	Объект.Наименование = Наименование;
	Объект.ТипЗначения = Справочники.кфкТипыЗначенийСпецификации.Строка;
	Объект.ОбъектКонфигурации = ОбъектКонфигурации;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Справочник.Значения.Наименование ГДЕ Владелец = &Владелец И ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Владелец", ОбъектКонфигурации);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект.Значения.Добавить().Значение = Выборка.Наименование;
	КонецЦикла;
	
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПолучитьВидПовышения(Данные, История, ЭтоНовый) Экспорт
	
	ВидыПовышения = Перечисления.кфкВидыПовышенияВерсий;
	Если ТипЗнч(История) = Тип("ИнформацияОЗаписиВерсииИсторииДанных") Тогда
		Возврат кфкРаботаСоСпецификациями.ПолучитьИндексСобытия(
			История, ЭтоНовый, ВидыПовышения.ДополняющаяВерсия, ВидыПовышения.ОсновнаяВерсия);
	КонецЕсли;
	
	РезультатыКлассификации = Новый Массив;
	Для Каждого КлючЗначение Из История Цикл
		ИмяРеквизита = КлючЗначение.Ключ;
		Изменения = КлючЗначение.Значение;

		Если ИмяРеквизита = "Владелец" Тогда
			ВызватьИсключение НСтр("ru = 'Нельзя изменять спецификацию!'");
		ИначеЕсли ИмяРеквизита = "ПометкаУдаления" Тогда
			ВидПовышения = ?(Изменения.ЗначениеПослеИзменения,
				ВидыПовышения.ОсновнаяВерсия, ВидыПовышения.ДополняющаяВерсия);
			РезультатыКлассификации.Очистить();
			РезультатыКлассификации.Добавить(ВидПовышения);
			Прервать;
		ИначеЕсли ИмяРеквизита = "ТипЗначения" Тогда
			ВидПовышения = ВидыПовышения.ОсновнаяВерсия;
		ИначеЕсли ИмяРеквизита = "ОбъектКонфигурации" Тогда
			ВидПовышения = ВидыПовышения.ДополняющаяВерсия;
		ИначеЕсли ИмяРеквизита = "Значения" Тогда
			ВидПовышения = ВидыПовышения.ДополняющаяВерсия;
			Для Каждого Элемент Из Изменения Цикл
				Если Элемент.ВидИзмененияСтроки = ВидИзмененияСтрокиДанных.Изменение
						Или Элемент.ВидИзмененияСтроки = ВидИзмененияСтрокиДанных.Удаление Тогда
					ВидПовышения = ВидыПовышения.ОсновнаяВерсия;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ИмяРеквизита = "Наименование" Тогда
			Продолжить;
		Иначе
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Неизвестное имя реквизита: %1'"), ИмяРеквизита);
		КонецЕсли;
		
		РезультатыКлассификации.Добавить(ВидПовышения);
	КонецЦикла;
	
	Возврат кфкРаботаСоСпецификациями.ПолучитьИндексИзменений(
		РезультатыКлассификации);
	
КонецФункции

#КонецОбласти

#КонецЕсли
