
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПослеЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий)
	
	РегистрыСведений.кфкИзмененияОбъектовСпецификаций.ОбработкаЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает созданное перечисление спецификации
// 
// Параметры:
//	Спецификация - СправочникСсылка.кфкПеречисленияСпецификации - Спецификация
//	ОбъектКонфигурации - СправочникСсылка.Объекты - Объект конфигурации
//	Наименование - Строка - Наименование перечисления
// 
// Возвращаемое значение:
//	СправочникСсылка.кфкПеречисленияСпецификации - Созданный элемент
Функция Создать(Спецификация, ОбъектКонфигурации, Наименование) Экспорт
	
	Объект = СоздатьЭлемент();
	Объект.Наименование = Наименование;
	Объект.ТипЗначения = Справочники.кфкТипыЗначенийСпецификации.Строка;
	Объект.ОбъектКонфигурации = ОбъектКонфигурации;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Справочник.Значения.Наименование ГДЕ Владелец = &Владелец И ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Владелец", ОбъектКонфигурации);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект.Значения.Добавить().Значение = Выборка.Наименование;
	КонецЦикла;
	
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПолучитьВидПовышения(Данные, История, ЭтоНовый) Экспорт
	
	ВидыПовышения = Перечисления.кфкВидыПовышенияВерсий;
	ИндексыПовышения = ВидыПовышения.Индексы();
	Результат = 9;
	
	Если ТипЗнч(История) = Тип("ИнформацияОЗаписиВерсииИсторииДанных") Тогда // Новый объект или удаление старого объекта
		Если ЭтоНовый Тогда
			Если История.ВидИзмененияДанных = ВидИзмененияДанных.Добавление Тогда
				ВидПовышения = ВидыПовышения.ДополняющаяВерсия;
				
			ИначеЕсли История.ВидИзмененияДанных = ВидИзмененияДанных.Изменение Тогда
				ВидПовышения = ?(
					ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(История.ДанныеВерсии, "ПометкаУдаления", Ложь),
					ВидыПовышения.ПустаяСсылка(), ВидыПовышения.ДополняющаяВерсия);
				
			Иначе
				ВидПовышения = ВидыПовышения.ПустаяСсылка();
				
			КонецЕсли;
			
		ИначеЕсли История.ВидИзмененияДанных = ВидИзмененияДанных.Удаление Тогда
			ВидПовышения = ВидыПовышения.ОсновнаяВерсия;
			
		Иначе
			ВызватьИсключение НСтр("ru = 'Недопустимый сценарий изменения!'");
			
		КонецЕсли;
		Результат = ИндексыПовышения.Найти(ВидПовышения);
		
	Иначе
		Для Каждого КлючЗначение Из История Цикл
			ИмяРеквизита = КлючЗначение.Ключ;
			Изменения = КлючЗначение.Значение;
			
			Если ИмяРеквизита = "Владелец" Тогда
				ВызватьИсключение НСтр("ru = 'Нельзя изменять спецификацию!'");
				
			ИначеЕсли ИмяРеквизита = "ПометкаУдаления" Тогда
				ВидПовышения = ?(Изменения.ЗначениеПослеИзменения,
					ВидыПовышения.ОсновнаяВерсия, ВидыПовышения.ДополняющаяВерсия);
				Результат = ИндексыПовышения.Найти(ВидПовышения);
				Прервать; // Признак удаления имеет приоритет
				
			ИначеЕсли ИмяРеквизита = "ТипЗначения" Тогда
				ВидПовышения = ВидыПовышения.ОсновнаяВерсия;
				
			ИначеЕсли ИмяРеквизита = "ОбъектКонфигурации" Тогда
				ВидПовышения = ВидыПовышения.ДополняющаяВерсия;
				
			ИначеЕсли ИмяРеквизита = "Значения" Тогда
				// По умолчанию любое изменение считается минорным
				//	но если есть изменения или удаления, то мажорным
				ВидПовышения = ВидыПовышения.ДополняющаяВерсия;
				Для Каждого Элемент Из Изменения Цикл
					Если Элемент.ВидИзмененияСтроки = ВидИзмененияСтрокиДанных.Изменение
							Или Элемент.ВидИзмененияСтроки = ВидИзмененияСтрокиДанных.Удаление Тогда
						ВидПовышения = ВидыПовышения.ОсновнаяВерсия;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
			Иначе
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестное имя реквизита: %1'"), ИмяРеквизита);
			КонецЕсли;
			
			Результат = Мин(Результат, ИндексыПовышения.Найти(ВидПовышения));
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ?(Результат = 9, -1, Результат);
	
КонецФункции

#КонецОбласти

#КонецЕсли
