
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Создать.
// 
// Параметры:
//	Спецификация - СправочникСсылка.кфкПеречисленияСпецификации - Спецификация
//	ОбъектКонфигурации - СправочникСсылка.Объекты - Объект конфигурации
//	Наименование - Строка - Наименование перечисления
// 
// Возвращаемое значение:
//	СправочникСсылка.кфкПеречисленияСпецификации - Созданный элемент
Функция Создать(Спецификация, ОбъектКонфигурации, Наименование) Экспорт
	
	Объект = СоздатьЭлемент();
	Объект.Наименование = Наименование;
	Объект.ТипЗначения = Справочники.кфкТипыЗначенийСпецификации.Строка;
	Объект.ОбъектКонфигурации = ОбъектКонфигурации;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Справочник.Значения.Наименование ГДЕ Владелец = &Владелец И ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Владелец", ОбъектКонфигурации);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект.Значения.Добавить().Значение = Выборка.Наименование;
	КонецЦикла;
	
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
