
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует версию спецификации.
//
// Параметры:
//	Спецификация - СправочникСсылка.кфкСпецификации - Спецификация.
//	Комментарий - Строка - Комментарий.
//
// Возвращаемое значение:
//	Структура - Результат выпуска:
//		* Успешно - Булево - Истина, если версия выпущена.
//		* ВерсияСпецификации - ДокументСсылка.кфкВерсияСпецификации, Неопределено - Выпущенная версия.
//		* Ошибки - Массив из Структура - Ошибки проверки спецификации.
Функция СформироватьВерсиюСпецификации(Спецификация, Комментарий = "") Экспорт

	Ошибки = кфкРаботаСоСпецификациями.ПроверитьСпецификацию(Спецификация);
	Результат = Новый Структура("Успешно, ВерсияСпецификации, Ошибки", Ложь, Неопределено, Ошибки);
	Если Ошибки.Количество() > 0 Тогда
		Возврат Результат;
	КонецЕсли;

	РегистрыСведений.кфкИзмененияОбъектовСпецификаций.УдалитьИзмененияУдаленныхНовинок(Спецификация);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.ОсновнаяВерсия КАК ОсновнаяВерсия,
	|	Т.ДополняющаяВерсия КАК ДополняющаяВерсия,
	|	Т.ВерсияИсправления КАК ВерсияИсправления
	|ИЗ
	|	РегистрСведений.кфкВерсииСпецификации.СрезПоследних(, Спецификация = &Спецификация) КАК Т
	|ГДЕ
	|	Т.Спецификация = &Спецификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыПовышенияВерсий.Ссылка КАК ВидПовышения
	|ИЗ
	|	(ВЫБРАТЬ
	|		МИНИМУМ(Т2.Порядок) КАК Порядок
	|	ИЗ
	|		РегистрСведений.кфкИзмененияОбъектовСпецификаций КАК Т1
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Перечисление.кфкВидыПовышенияВерсий КАК Т2
	|			ПО Т1.ВидПовышения = Т2.Ссылка
	|	ГДЕ
	|		Т1.Спецификация = &Спецификация) КАК ИзмененияСпецификаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Перечисление.кфкВидыПовышенияВерсий КАК ВидыПовышенияВерсий
	|		ПО ИзмененияСпецификаций.Порядок = ВидыПовышенияВерсий.Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Объект КАК Объект,
	|	Т.НомерВерсии КАК НомерВерсии
	|ИЗ
	|	РегистрСведений.кфкИзмененияОбъектовСпецификаций КАК Т
	|ГДЕ
	|	Т.Спецификация = &Спецификация
	|	И Т.ВидИзменений В (ЗНАЧЕНИЕ(Перечисление.кфкВидыИзмененияДанных.Добавление),
	|		ЗНАЧЕНИЕ(Перечисление.кфкВидыИзмененияДанных.Изменение))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Объект КАК Объект,
	|	Т.БазоваяВерсия КАК НомерВерсии
	|ИЗ
	|	РегистрСведений.кфкИзмененияОбъектовСпецификаций КАК Т
	|ГДЕ
	|	Т.Спецификация = &Спецификация
	|	И Т.ВидИзменений = ЗНАЧЕНИЕ(Перечисление.кфкВидыИзмененияДанных.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	РезультатЗапроса = Запрос.ВыполнитьПакет();

	// Текущая версия спецификации
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ОсновнаяВерсия = Выборка.ОсновнаяВерсия;
		ДополняющаяВерсия = Выборка.ДополняющаяВерсия;
		ВерсияИсправления = Выборка.ВерсияИсправления;
	Иначе
		ОсновнаяВерсия = 0;
		ДополняющаяВерсия = 0;
		ВерсияИсправления = 0;
	КонецЕсли;

	// Определяем новую версию спецификации
	Выборка = РезультатЗапроса[1].Выбрать();
	ВидПовышения = ?(Выборка.Следующий(), Выборка.ВидПовышения, Неопределено);
	Если ОсновнаяВерсия = 0 Или ВидПовышения = Перечисления.кфкВидыПовышенияВерсий.ОсновнаяВерсия Тогда
		ОсновнаяВерсия = ОсновнаяВерсия + 1;
		ДополняющаяВерсия = 0;
		ВерсияИсправления = 0;
	ИначеЕсли ВидПовышения = Перечисления.кфкВидыПовышенияВерсий.ДополняющаяВерсия Тогда
		ДополняющаяВерсия = ДополняющаяВерсия + 1;
		ВерсияИсправления = 0;
	ИначеЕсли ВидПовышения = Перечисления.кфкВидыПовышенияВерсий.ВерсияИсправления Тогда
		ВерсияИсправления = ВерсияИсправления + 1;
	Иначе
		ВызватьИсключение НСтр("ru = 'Нет изменений для фиксации версии спецификации'");
	КонецЕсли;

	ИзмененияОбъектов = РегистрыСведений.кфкИзмененияОбъектовСпецификаций.СоздатьНаборЗаписей();
	ИзмененияОбъектов.Отбор.Спецификация.Установить(Спецификация);

	ВерсияСпецификации = СоздатьДокумент();
	ВерсияСпецификации.Номер = СтрШаблон("%1.%2.%3",
		Формат(ОсновнаяВерсия, "ЧЦ=2; ЧН=00; ЧВН=;"),
		Формат(ДополняющаяВерсия, "ЧЦ=2; ЧН=00; ЧВН=;"),
		Формат(ВерсияИсправления, "ЧЦ=2; ЧН=00; ЧВН=;"));
	ВерсияСпецификации.Дата = ТекущаяДатаСеанса();
	ВерсияСпецификации.Спецификация = Спецификация;
	ВерсияСпецификации.ОсновнаяВерсия = ОсновнаяВерсия;
	ВерсияСпецификации.ДополняющаяВерсия = ДополняющаяВерсия;
	ВерсияСпецификации.ВерсияИсправления = ВерсияИсправления;
	ВерсияСпецификации.Автор = Пользователи.ТекущийПользователь();
	ВерсияСпецификации.Комментарий = Комментарий;

	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл

		НоваяСтрока = ВерсияСпецификации.ВерсииОбъектов.Добавить();
		НоваяСтрока.Объект = Выборка.Объект;
		НоваяСтрока.НомерВерсии = Выборка.НомерВерсии;

		НоваяЗапись = ИзмененияОбъектов.Добавить();
		НоваяЗапись.Спецификация = Спецификация;
		НоваяЗапись.Объект = Выборка.Объект;
		НоваяЗапись.БазоваяВерсия = Выборка.НомерВерсии;

	КонецЦикла;

	НачатьТранзакцию();
	Попытка

		ИзмененияОбъектов.Записать();
		ВерсияСпецификации.Записать(РежимЗаписиДокумента.Проведение);

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Результат.Успешно = Истина;
	Результат.ВерсияСпецификации = ВерсияСпецификации.Ссылка;
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
