
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Номер = СтрШаблон("%1.%2.%3", ФорматВерсии(ОсновнаяВерсия), ФорматВерсии(ДополняющаяВерсия),
		ФорматВерсии(ВерсияИсправления));
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр кфкВерсииСпецификации
	Движения.кфкВерсииСпецификации.Записывать = Истина;
	Движение = Движения.кфкВерсииСпецификации.Добавить();
	Движение.Период = Дата;
	Движение.Спецификация = Спецификация;
	Движение.ОсновнаяВерсия = ОсновнаяВерсия;
	Движение.ДополняющаяВерсия = ДополняющаяВерсия;
	Движение.ВерсияИсправления = ВерсияИсправления;
	Движение.Версия = СтрШаблон("%1.%2.%3", ОсновнаяВерсия, ДополняющаяВерсия, ВерсияИсправления);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ФорматВерсии(Значение)
	Возврат Формат(Значение, "ЧЦ=2; ЧН=00; ЧВН=;");
КонецФункции

#КонецОбласти

#КонецЕсли
