
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр кфкВерсииСпецификации
	Движения.кфкВерсииСпецификации.Записывать = Истина;
	Движение = Движения.кфкВерсииСпецификации.Добавить();
	Движение.Период = Дата;
	Движение.Спецификация = Спецификация;
	Движение.ОсновнаяВерсия = ОсновнаяВерсия;
	Движение.ДополняющаяВерсия = ДополняющаяВерсия;
	Движение.ВерсияИсправления = ВерсияИсправления;
	Движение.Версия = СтрШаблон("%1.%2.%3", ОсновнаяВерсия, ДополняющаяВерсия, ВерсияИсправления);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
