
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура кфкПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаИдентификацияОбъекта.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	Группа = Элементы.Добавить("кфкИменаОбъекта", Тип("ГруппаФормы"), Элементы.ГруппаИдентификацияОбъекта);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.ОтображатьЗаголовок = Ложь;
	
	Элементы.Переместить(Элементы.Имя, Группа);
	
	Элемент = Элементы.Добавить("кфкИмяEN", Тип("ПолеФормы"), Группа);
	Элемент.ПутьКДанным = "Объект.кфкИмяEN";
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры

#КонецОбласти
