#Область ОбработчикиСобытийФормы

&НаСервере
Процедура кфк_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Команда = Команды.Добавить("кфк_СопоставлениеПоШаблону");
	Команда.Действие = "кфк_СопоставлениеПоШаблону";
	
	Элемент = Элементы.Вставить("кфк_СопоставлениеПоШаблону", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель,
		Элементы.ФормаСоздатьПравилаКонвертацииСвойств);
	Элемент.ИмяКоманды = "кфк_СопоставлениеПоШаблону";
	Элемент.Заголовок = "Сопоставление по шаблону";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

//@skip-check module-unused-method
//@skip-check module-structure-form-event-regions
&НаКлиенте
Асинх Процедура кфк_СопоставлениеПоШаблону(Команда)
	
	ШаблонСтрокой = Ждать ВвестиСтрокуАсинх("", "Введите шаблон сопоставления", 0, Истина);
	Если ПустаяСтрока(ШаблонСтрокой) Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваКонфигурации = Новый Структура;
	кфк_ЗаполнитьСвойстваКонфигурации(СвойстваКонфигурации, СопоставлениеСвойствДерево);
	
	СвойстваФормата = Новый Структура;
	Для Каждого Свойство Из СписокСвойствФормата Цикл
		СвойстваФормата.Вставить(СтрЗаменить(Свойство.Значение, ".", "_"), Свойство.Значение);
	КонецЦикла;
	
	Для Каждого Шаблон Из СтрРазделить(ШаблонСтрокой, Символы.ПС, Ложь) Цикл
		
		//	<СвойствоКонфигурации>:<СвойствоФормата>
		Поля = СтрРазделить(Шаблон, ":", Ложь);
		Если Поля.Количество() <> 2 Тогда
			Продолжить;
		КонецЕсли;
		
		СвойствоКонфигурации = СокрЛП(Поля[0]);
		СвойствоФормата = СокрЛП(Поля[1]);
		
		Строка = Неопределено;
		
		Если ПустаяСтрока(СвойствоКонфигурации) Или ПустаяСтрока(СвойствоФормата)
			Или Не СвойстваФормата.Свойство(СтрЗаменить(СвойствоФормата, ".", "_"), СвойствоФормата)
			Или Не СвойстваКонфигурации.Свойство(СтрЗаменить(СвойствоКонфигурации, ".", "_"), Строка) Тогда
			Продолжить;
		КонецЕсли;
		
		Строка.СвойствоФормата = СвойствоФормата;
		Элементы.СопоставлениеСвойствДерево.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
		
		ОбработатьВыборСвойства("СвойствоФормата", "ТипСвойстваФормата", СвойствоФормата, "СвойствоКонфигурации");
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура кфк_ЗаполнитьСвойстваКонфигурации(Свойства, Дерево)
	
	Для Каждого Строка Из Дерево.ПолучитьЭлементы() Цикл
		
		Если Строка.Сопоставлено Или ПустаяСтрока(Строка.СвойствоКонфигурации) Тогда
			Продолжить;
		КонецЕсли;
		
		Свойства.Вставить(СтрЗаменить(Строка.СвойствоКонфигурации, ".", "_"), Строка);
		
		кфк_ЗаполнитьСвойстваКонфигурации(Свойства, Строка);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
