#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает массив ссылочных типов объектов
// 
// Возвращаемое значение:
//  Массив Из ПеречислениеСсылка.ТипыОбъектов - Ссылочные типы объектов
Функция кфкСсылочныеТипы() Экспорт

	Результат = Новый Массив;
	Результат.Добавить(ЛюбаяСсылка);
	Результат.Добавить(Справочник);
	Результат.Добавить(Документ);
	Результат.Добавить(ПланВидовХарактеристик);
	Результат.Добавить(ПланСчетов);
	Результат.Добавить(ПланВидовРасчета);
	Результат.Добавить(ПланОбмена);
	Результат.Добавить(БизнесПроцесс);
	Результат.Добавить(Задача);
	Результат.Добавить(ТочкаМаршрутаБизнесПроцесса);
	Результат.Добавить(ВидРасчета);
	Результат.Добавить(ВидСубконто);

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
