#Область СлужебныеПроцедурыИФункции
&ИзменениеИКонтроль("ПомещениеФайловНаСерверЗавершение")
&НаКлиенте
Процедура кфк_ПомещениеФайловНаСерверЗавершение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	Если ПомещенныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеПараметры.Расширение Тогда
		Объект.ИмяФайлаРасширенияФормата = "";
		Объект.ДобавлятьТолькоНовыеОбъектыСвойстваЗначения = Ложь;
		Если ПомещенныеФайлы <> Неопределено Тогда
			Объект.ИмяФайлаРасширенияФормата = ПомещенныеФайлы[0].Имя;
			АдресВременногоХраненияДанныхРасширения = ПомещенныеФайлы[0].Хранение;
			ПроверитьЗагруженныеФайлы(Истина);
		Иначе
			ТекстОшибки = НСтр("ru = 'Ошибка передачи файла структуры расширения формата на сервер'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Объект.ИмяФайлаРасширенияФормата");
		КонецЕсли;
	Иначе
		#Удаление
		Если ПомещенныеФайлы.Количество() <> 2 Тогда
			ТекстОшибки = НСтр("ru = 'Количество выбранных файлов неверно. Должно быть выбрано два файла со структурой формата.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Объект.ИменаФайловДляЗагрузки");
			Возврат;
		КонецЕсли;
		#КонецУдаления
		Объект.ИменаФайловДляЗагрузки.Очистить();
		Объект.ВерсияФормата = Неопределено;
		Объект.ИмяОсновногоПакетаXDTO = "";

		Если Не ПомещенныеФайлы = Неопределено Тогда
			Для Каждого ПомещенныйФайл Из ПомещенныеФайлы Цикл
				Объект.ИменаФайловДляЗагрузки.Добавить(ПомещенныйФайл.Хранение, ПомещенныйФайл.Имя);
			КонецЦикла;
			// Если уже выбран файл с расширением то вычислять имя пакета и версию формата не требуется.
			Если НЕ ЗначениеЗаполнено(Объект.ИмяФайлаРасширенияФормата) Тогда
				ПроверитьЗагруженныеФайлы(Ложь);
			КонецЕсли;
		Иначе
			ТекстОшибки = НСтр("ru = 'Ошибка передачи файлов структуры формата на сервер'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Объект.ИменаФайловДляЗагрузки");
		КонецЕсли;
	КонецЕсли;
	УстановитьВидимость();

КонецПроцедуры

&ИзменениеИКонтроль("ПрочитатьДанныеОПакетахXDTO")
Процедура кфк_ПрочитатьДанныеОПакетахXDTO(ВсеПакетыXDTO, АдресХранилищаФайлаСхемы)
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xsd");

	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилищаФайлаСхемы);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);

	ЭтоОсновнаяСхема = Ложь;
	ТекИмяПакета = "";
	ЕстьДирективаИмпорт = Ложь;
	ДанныеФайла = Новый ЧтениеXML;
	ДанныеФайла.ОткрытьФайл(ИмяВременногоФайла);
	ДанныеФайла.Прочитать();

	Если ДанныеФайла.Имя = "xs:schema" Тогда
		Пока ДанныеФайла.ПрочитатьАтрибут() Цикл
			Если ДанныеФайла.Имя = "targetNamespace" Тогда
				ТекИмяПакета = СокрЛП(ДанныеФайла.Значение);
			КонецЕсли;
		КонецЦикла;
		ДанныеФайла.Прочитать();
		Если ДанныеФайла.Имя = "xs:import" Тогда
			ЕстьДирективаИмпорт = Истина;
		КонецЕсли;
	КонецЕсли;
	#Удаление
	Если НЕ ЕстьДирективаИмпорт Тогда
		Возврат;
	КонецЕсли;
	#КонецУдаления
	СведенияОФормате = РазобратьИмяПакетаXDTO(ТекИмяПакета);
	НомерВерсииФормата = СведенияОФормате.НомерВерсииФормата;
	ШаблонПространстваИмен = СведенияОФормате.ШаблонПространстваИмен;
	// Ищем родителя.
	РодительВерсии = Справочники.ВерсииФормата.НайтиПоРеквизиту("ПространствоИмен", ШаблонПространстваИмен, Справочники.ВерсииФормата.ПустаяСсылка());
	СведенияОФормате.Вставить("РодительВерсии", РодительВерсии);
	Если ЗначениеЗаполнено(РодительВерсии) Тогда
		ВерсияФормата = Справочники.ВерсииФормата.НайтиПоНаименованию(НомерВерсииФормата,,РодительВерсии);
		СведенияОФормате.Вставить("ВерсияФормата", ВерсияФормата);
	Иначе
		СведенияОФормате.Вставить("ВерсияФормата", Справочники.ВерсииФормата.ПустаяСсылка());
	КонецЕсли;
	ВсеПакетыXDTO.Вставить(ТекИмяПакета, СведенияОФормате);
	ДанныеФайла.Закрыть();
	УдалитьФайлы(ИмяВременногоФайла);
КонецПроцедуры
#КонецОбласти
