#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ОбработкаЗаполнения")
Процедура кфкОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	//@skip-check module-unused-local-variable
	//@skip-check reading-attribute-from-database
	//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
		Наименование = ДанныеЗаполнения.Код;
		ГруппаПравил = ДанныеЗаполнения.ГруппаПравил;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
