
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура кфк_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ПравилаКонвертацииОбъектов.ТекстЗапроса = СтрЗаменить(ПравилаКонвертацииОбъектов.ТекстЗапроса,
		"ОбъектКонфигурации,", "ОбъектКонфигурации,кфк_ТабличнаяЧасть,");
	
	Элемент = Элементы.Вставить("кфк_ТабличнаяЧасть", Тип("ПолеФормы"), Элементы.ПравилаКонвертацииОбъектов,
		Элементы.ПравилаКонвертацииОбъектовОбъектКонфигурацииКорреспондент);
	Элемент.ПутьКДанным = "ПравилаКонвертацииОбъектов.кфк_ТабличнаяЧасть";
	Элемент.Вид = ВидПоляФормы.ПолеНадписи;
	Элемент.Заголовок = "ТЧ";
	
КонецПроцедуры

#КонецОбласти
