
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Отправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "Владелец");
		Объект.Наименование = КодТипаДанных(Объект.ТипДанных);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипДанныхПриИзменении(Элемент)
	
	Объект.Наименование = КодТипаДанных(Объект.ТипДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция КодТипаДанных(ТипДанных)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипДанных, "Код");
КонецФункции

#КонецОбласти
