
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = АдресКанала(Объект.Владелец, Объект.ТипДанных);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипДанныхПриИзменении(Элемент)
	
	Адрес = АдресКанала(Объект.Владелец, Объект.ТипДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция АдресКанала(Спецификация, ТипДанных)
	
	Если Спецификация.Пустая() Или ТипДанных.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.ПрефиксАдреса КАК ПрефиксАдреса,
	|	Т.ПостфиксАдреса КАК ПостфиксАдреса
	|ИЗ
	|	Справочник.кфкСпецификации КАК Т
	|ГДЕ
	|	Т.Ссылка = &Спецификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Код КАК Код
	|ИЗ
	|	Справочник.кфкТипыДанныхСпецификации КАК Т
	|ГДЕ
	|	Т.Ссылка = &ТипДанных";
	
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаСпецификации = РезультатЗапроса[0].Выбрать();
	ВыборкаТипа = РезультатЗапроса[1].Выбрать();
	
	Если ВыборкаСпецификации.Следующий() И ВыборкаТипа.Следующий() Тогда
		Возврат ВыборкаСпецификации.ПрефиксАдреса + ВыборкаТипа.Код + ВыборкаСпецификации.ПостфиксАдреса;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
