
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Реквизит Из ПолучитьРеквизиты() Цикл
		Если Реквизит.ТипЗначения.СодержитТип(Тип("ДинамическийСписок")) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(ЭтотОбъект, Реквизит.Имя),
				?(Реквизит.Имя = "ВерсииСпецификации", "Спецификация", "Владелец"), Параметры.Спецификация);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТипыДанныхСпецификации

&НаКлиенте
Процедура ТипыДанныхСпецификацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.кфкТипыДанныхСпецификации.ФормаОбъекта", Новый Структура("Ключ", ВыбраннаяСтрока),
		ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ВыпуститьВерсию(Команда)
	
	Комментарий = Ждать ВвестиСтрокуАсинх("", НСтр("ru = 'Комментарий к версии'"), 0, Истина);
	Если Комментарий = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = СформироватьВерсиюСпецификации(Параметры.Спецификация, Комментарий);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Выпуск версии спецификации'");
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
		Новый ОписаниеОповещения("ЗавершениеВыпускаВерсии", ЭтотОбъект), ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВерсиюЯМЛ(Команда)
	
	ТекущиеДанные = Элементы.ВерсииСпецификации.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = НачатьФормированиеAsyncAPI(УникальныйИдентификатор, ТекущиеДанные.Ссылка);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Формирование AsyncAPI'");
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
		Новый ОписаниеОповещения("ЗавершениеФормированияAsyncAPI", ЭтотОбъект), ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗавершениеВыпускаВерсии(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
			
		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Не удалось выпустить версию'"));
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ВерсииСпецификации.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФормированияAsyncAPI(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
			
		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Не удалось сформировать AsyncAPI'"));
		КонецЕсли;
		
		Возврат;
		
	ИначеЕсли Не ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не удалось сформировать AsyncAPI: не получен результат'"));
		Возврат;
		
	КонецЕсли;
	
	Описание = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	ИмяФайла = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Описание, "ИмяФайла");
	ДанныеФайла = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Описание, "ДанныеФайла");
	Если ПустаяСтрока(ИмяФайла) Или ДанныеФайла = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не удалось сформировать AsyncAPI: получен пустой результат'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохранения.Диалог.Заголовок = НСтр("ru = 'Выберите файл'");
	ПараметрыСохранения.Диалог.Фильтр = "Файл YAML (*.yaml)|*.yaml";
	ФайловаяСистемаКлиент.СохранитьФайл(Новый ОписаниеОповещения("СохранитьФайлYAMLЗавершение", ЭтотОбъект),
		ПоместитьВоВременноеХранилище(ДанныеФайла), ИмяФайла, ПараметрыСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлYAMLЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ПолученныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьВерсиюСпецификации(Спецификация, Комментарий)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выпуск версии спецификации'");
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
		"Документы.кфкВерсияСпецификации.СформироватьВерсиюСпецификации", Спецификация, Комментарий);
	
КонецФункции

&НаСервереБезКонтекста
Функция НачатьФормированиеAsyncAPI(УникальныйИдентификатор, ВерсияСпецификации)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование AsyncAPI'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"Обработки.кфкКонструкторAsyncAPI.СформироватьAsyncAPI", ВерсияСпецификации);
	
КонецФункции

#КонецОбласти
