
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура кфкПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Группа = Элементы.Вставить("кфкОбъектКонфигурацииТабличнаяЧасть", Тип("ГруппаФормы"), Элементы.ГруппаОбъекты, Элементы.ОбъектФормата);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	
	Элементы.Переместить(Элементы.ОбъектКонфигурации, Группа);
	
	Элемент = Элементы.Добавить("кфкТабличнаяЧасть", Тип("ПолеФормы"), Группа);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.кфкТабличнаяЧасть";
	Элемент.Заголовок = "ТЧ";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура кфкЗаполнитьИдентификаторПосле(Команда)
	
	Если Не ЭтоКонвертацияXDTO Или Объект.ОбъектКонфигурации.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Код = кфкПолучитьИдентификатор(Объект.ОбъектКонфигурации, Объект.кфкТабличнаяЧасть, Объект.ГруппаПравил);
	
	Если Не (Объект.ИспользоватьДляОтправки И Объект.ИспользоватьДляПолучения) Тогда
		Объект.Код = Объект.Код + ?(Объект.ИспользоватьДляПолучения, "_Получение", "_Отправка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//@skip-check change-and-validate-instead-of-around
&Вместо("ПроверитьНеобходимостьЗаполненияПКОВПКС")
&НаСервере
Функция кфкПроверитьНеобходимостьЗаполненияПКОВПКС()
	Возврат Ложь;
КонецФункции

&НаСервереБезКонтекста
Функция кфкПолучитьИдентификатор(ОбъектКонфигурации, ТабличнаяЧасть, Группа)
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Объекты.Имя КАК Имя,
	|	Объекты.Тип КАК Тип,
	|	ПРЕДСТАВЛЕНИЕ(Объекты.Родитель) КАК Группа
	|ИЗ
	|	Справочник.Объекты КАК Объекты
	|ГДЕ
	|	Объекты.Ссылка = &Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Свойства.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Свойства КАК Свойства
	|ГДЕ
	|	Свойства.Ссылка = &Свойство";
	Запрос.УстановитьПараметр("Объект", ОбъектКонфигурации);
	Запрос.УстановитьПараметр("Свойство", ТабличнаяЧасть);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		
		Группа = Выборка.Группа;
		
		ЧастиИмени = СтрРазделить(Выборка.Имя, "_", Ложь);
		Результат = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.Тип) + "_" + ЧастиИмени[ЧастиИмени.ВГраница()];
		
		ВыборкаТЧ = РезультатЗапроса[1].Выбрать();
		Если ВыборкаТЧ.Следующий() Тогда
			ЧастиИмени = СтрРазделить(ВыборкаТЧ[0], "_", Ложь);
			Результат = Результат + "_" + ЧастиИмени[ЧастиИмени.ВГраница()];
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
