
#Область ОбработчикиСобытий

&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Канал = КаналСпецификации(ПараметрКоманды);
	Если Канал <> Неопределено Тогда
		
		Список = Новый СписокЗначений;
		Список.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Открыть существующий'"));
		Список.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Создать новый'"));
		Список.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
		Ответ = Ждать ВопросАсинх(
			НСтр("ru = 'Открыть существующий или создать новый?'"), Список, 30, КодВозвратаДиалога.Нет,
			НСтр("ru = 'Канал спецификации уже существует.'"));
		
		// Открыть существующий
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			ПоказатьЗначение(, Канал);
		КонецЕсли;
		
		// Не создавать новый
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	// Создать новый
	ОткрытьФорму("Справочник.кфкКаналыСпецификации.ФормаОбъекта", Новый Структура("Основание", ПараметрКоманды),
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка, , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция КаналСпецификации(ТипДанных)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.кфкКаналыСпецификации КАК Т
		|ГДЕ
		|	Т.ТипДанных = &ТипДанных";
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка[0], Неопределено);
	
КонецФункции

#КонецОбласти
