
#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ЗаполнитьТаблицыСвойств")
&НаСервере
Процедура кфк_ЗаполнитьТаблицыСвойств()
	#Удаление
	ДанныеПКО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "ОбъектКонфигурации, ОбъектФормата, ОбъектКонфигурацииКорреспондент");
	КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствКонфигурации(ТаблицаСвойствКонфигурации,
			Объект.Владелец,
			ДанныеПКО.ОбъектКонфигурации,
			Новый Структура("ЭтоГруппа, Родитель", Истина, ""));
	#КонецУдаления
	#Вставка
	ДанныеПКО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "ОбъектКонфигурации, кфк_ТабличнаяЧасть, ОбъектФормата, ОбъектКонфигурацииКорреспондент");
	Если ЗначениеЗаполнено(ДанныеПКО.кфк_ТабличнаяЧасть) Тогда
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствКонфигурации(ТаблицаСвойствКонфигурации,
			Объект.Владелец,
			ДанныеПКО.ОбъектКонфигурации,
			Новый Структура("ЭтоГруппа, Родитель", Истина, ДанныеПКО.кфк_ТабличнаяЧасть));
		
	Иначе
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствКонфигурации(ТаблицаСвойствКонфигурации,
			Объект.Владелец,
			ДанныеПКО.ОбъектКонфигурации,
			Новый Структура("ЭтоГруппа, Родитель", Истина, ""));
		
	КонецЕсли;
	#КонецВставки
	Если ЭтоКонвертацияXDTO Тогда
		ФильтрСвойствФормата = Новый Структура("ОбъектФормата, ЭтоГруппа, Родитель",  ДанныеПКО.ОбъектФормата, Истина, "");
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствФормата(ТаблицаСвойствФормата,
				Объект.Владелец,
				ФильтрСвойствФормата);
	Иначе
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствКонфигурации(ТаблицаСвойствКонфигурацииКорреспондент,
			Объект.Владелец,
			ДанныеПКО.ОбъектКонфигурацииКорреспондент,
			Новый Структура("ЭтоГруппа, Родитель, Корреспондент", Истина, "", Истина));

	КонецЕсли;
КонецПроцедуры

#КонецОбласти
