#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Код");
	Поля.Добавить("Наименование");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтрШаблон("%1 (%2)", Данные.Код, Данные.Наименование);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру с описанием типа данных
// 
// Параметры:
//	Ссылка - СправочникСсылка.кфкТипыДанныхСпецификации - Ссылка
// 
// Возвращаемое значение:
//	Структура - Описание типа:
//		* Ссылка - СправочникСсылка.кфкТипыДанныхСпецификации - Ссылка
//		* Владелец - СправочникСсылка.кфкСпецификации - Владелец
//		* Родитель - СправочникСсылка.кфкТипыДанныхСпецификации - Родитель
//		* Код - Строка - Код
//		* Наименование - Строка - Наименование
//		* ПометкаУдаления - Булево - ПометкаУдаления
//		* Описание - Строка - Описание
//		* ТипДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - ТипДанных
//		* ФорматДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - ФорматДанных
//		* Минимум - Число - Минимум
//		* Максимум - Число - Максимум
//		* Перечисление - СправочникСсылка.кфкПеречисленияСпецификации - Перечисление
//		* РегулярноеВыражение - Строка - РегулярноеВыражение
//		* Устарело - Булево - Устарело
//		* Обязательное - Булево - Обязательное
//		* ЗначениеПоУмолчанию - Неопределено,Строка,Число,Дата,Булево - ЗначениеПоУмолчанию
//		* ОбъектКонфигурации - Неопределено,СправочникСсылка.Объекты, СправочникСсылка.Свойства - Объект или свойство конфигурации
//		* БазовыеТипы - ФиксированныйМассив Из СправочникСсылка.кфкТипыДанныхСпецификации - Базовые типы
//		* БазовыеТипыСтрокой - Строка - Базовые типы в виде строки
Функция ОписаниеТипа(Ссылка) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", ПустаяСсылка());
	Результат.Вставить("ПометкаУдаления", Ложь);
	Результат.Вставить("Владелец", Справочники.кфкСпецификации.ПустаяСсылка());
	Результат.Вставить("Родитель", ПустаяСсылка());
	Результат.Вставить("Код", "");
	Результат.Вставить("Наименование", "");
	Результат.Вставить("Описание", "");
	Результат.Вставить("ТипДанных", Справочники.кфкТипыЗначенийСпецификации.ПустаяСсылка());
	Результат.Вставить("ФорматДанных", Справочники.кфкТипыЗначенийСпецификации.ПустаяСсылка());
	Результат.Вставить("Минимум", 0);
	Результат.Вставить("Максимум", 0);
	Результат.Вставить("Перечисление", Справочники.кфкПеречисленияСпецификации.ПустаяСсылка());
	Результат.Вставить("РегулярноеВыражение", "");
	Результат.Вставить("Устарело", Ложь);
	Результат.Вставить("Обязательное", Ложь);
	Результат.Вставить("ЗначениеПоУмолчанию", Неопределено);
	Результат.Вставить("ОбъектКонфигурации", Неопределено);
	Результат.Вставить("БазовыеТипы", Новый ФиксированныйМассив(Новый Массив));
	Результат.Вставить("БазовыеТипыСтрокой", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.ПометкаУдаления КАК ПометкаУдаления,
	|	Т.Владелец КАК Владелец,
	|	Т.Родитель КАК Родитель,
	|	Т.Код КАК Код,
	|	Т.Наименование КАК Наименование,
	|	Т.Описание КАК Описание,
	|	Т.ТипДанных КАК ТипДанных,
	|	Т.ФорматДанных КАК ФорматДанных,
	|	Т.Минимум КАК Минимум,
	|	Т.Максимум КАК Максимум,
	|	Т.Перечисление КАК Перечисление,
	|	Т.РегулярноеВыражение КАК РегулярноеВыражение,
	|	Т.Устарело КАК Устарело,
	|	Т.Обязательное КАК Обязательное,
	|	Т.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	|	Т.ОбъектКонфигурации КАК ОбъектКонфигурации
	|ИЗ
	|	Справочник.кфкТипыДанныхСпецификации КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Тип КАК Тип
	|ИЗ
	|	Справочник.кфкТипыДанныхСпецификации.БазовыеТипы КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		
		// Описание элемента
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		// ТЧ БазовыеТипы
		Если Выборка.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Структура Тогда
			
			БазовыеТипы = Новый Массив;
			БазовыеТипыСтрокой = Новый Массив;
			
			ВыборкаБазовыеТипы = РезультатЗапроса[1].Выбрать();
			Пока ВыборкаБазовыеТипы.Следующий() Цикл
				БазовыеТипы.Добавить(ВыборкаБазовыеТипы.Тип);
				БазовыеТипыСтрокой.Добавить(ОбщегоНазначения.СтроковоеПредставлениеТипа(ВыборкаБазовыеТипы.Тип));
			КонецЦикла;
			
			Результат.БазовыеТипы = Новый ФиксированныйМассив(БазовыеТипы);
			Результат.БазовыеТипыСтрокой = СтрСоединить(БазовыеТипы, ",");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает подчиненные элементы справочника
// 
// Параметры:
//	Родитель - СправочникСсылка.кфкТипыДанныхСпецификации - Родитель
// 
// Возвращаемое значение:
//	ДеревоЗначений - Подчинные элементы:
//		* Ссылка - СправочникСсылка.кфкТипыДанныхСпецификации - Ссылка
//		* Владелец - СправочникСсылка.кфкСпецификации - Владелец
//		* Родитель - СправочникСсылка.кфкТипыДанныхСпецификации - Родитель
//		* Код - Строка - Код
//		* Наименование - Строка - Наименование
//		* ПометкаУдаления - Булево - ПометкаУдаления
//		* Описание - Строка - Описание
//		* ТипДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - ТипДанных
//		* ФорматДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - ФорматДанных
//		* Минимум - Число - Минимум
//		* Максимум - Число - Максимум
//		* Перечисление - СправочникСсылка.кфкПеречисленияСпецификации - Перечисление
//		* РегулярноеВыражение - Строка - РегулярноеВыражение
//		* Устарело - Булево - Устарело
//		* Обязательное - Булево - Обязательное
//		* ЗначениеПоУмолчанию - Строка,Число,Дата,Булево - ЗначениеПоУмолчанию
//		* ОбъектКонфигурации - СправочникСсылка.Объекты, СправочникСсылка.Свойства - Объект или свойство конфигурации
//		* БазовыеТипы - ФиксированныйМассив Из СправочникСсылка.кфкТипыДанныхСпецификации - Базовые типы
//		* БазовыеТипыСтрокой - Строка - Базовые типы в виде строки
Функция ПодчинныеЭлементы(Родитель) Экспорт
	
	Результат = Новый ДеревоЗначений;
	// Создаем колонки дерева значений
	ОбъектМетаданных = Метаданные.Справочники.кфкТипыДанныхСпецификации;
	Для Каждого ИмяРеквизита Из СтрРазделить("Ссылка,Владелец,Родитель,Код,Наименование,ПометкаУдаления", ",") Цикл
		Результат.Колонки.Добавить(ИмяРеквизита, ОбъектМетаданных.СтандартныеРеквизиты[ИмяРеквизита].Тип);
	КонецЦикла;
	Для Каждого Реквизит Из Метаданные.Справочники.кфкТипыДанныхСпецификации.Реквизиты Цикл
		Результат.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;
	Результат.Колонки.Добавить("БазовыеТипы", Новый ОписаниеТипов("ФиксированныйМассив"));
	Результат.Колонки.Добавить("БазовыеТипыСтрокой", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	ДобавитьПодчиненныеЭлементы(Родитель, Результат.Строки);
	
	Возврат Результат;
	
КонецФункции

// Создает свойства типа данных
// 
// Параметры:
//	Владелец - СправочникСсылка.кфкСпецификации - Владелец
//	ТипДанных - СправочникСсылка.кфкТипыДанныхСпецификации - Тип данных
//	Дерево - ДеревоЗначений - Дерево свойств:
//		* Добавить - Число - Признак добавления свойства, 0 - не добавлять, 1 - добавить всю цепочку, 2 - добавить часть подчиненных элементов
//		* СвойствоКонфигурации - СправочникСсылка.Свойства - Свойство конфигурации
//		* СвойствоКонфигурацииНаименование - Строка - Наименование свойства конфигурации
//		* СвойствоКонфигурацииСиноним - Строка - Синоним свойства конфигурации
//		* ТипСвойстваКонфигурации - СправочникСсылка.Объекты - Тип свойства конфигурации
//		* ТипОбъекта - ПеречислениеСсылка.ТипыОбъектов - Тип объекта
//		* Свойство - Строка - Свойство
//		* ТипДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - Тип данных
//		* ФорматДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - Формат данных
//		* Перечисление - СправочникСсылка.кфкПеречисленияСпецификации - Перечисление
//		* Минимум - Число - Минимум
//		* Максимум - Число - Максимум
//		* Ссылка - СправочникСсылка.кфкТипыДанныхСпецификации - Ссылка
// 
// Возвращаемое значение:
//	Структура - Результат создания свойств:
//		* Успешно - Булево - Признак успешного создания свойств
//		* ТекстОшибки - Строка - Текст ошибки
Функция СоздатьСвойства(Владелец, ТипДанных, Дерево) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Истина);
	Результат.Вставить("ТекстОшибки", "");
	
	ПеречисленияСпецификации = Новый Соответствие;
	
	НачатьТранзакцию();
	Попытка
		
		Для Каждого Строка Из Дерево.Строки Цикл
			
			Если Строка.Добавить = 0 Тогда
				Продолжить;
				
			ИначеЕсли Строка.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Массив Тогда // Табличная часть
				Родитель = ДобавитьСвойствоТипаДанных(Владелец, ТипДанных, Строка, ПеречисленияСпецификации);
				Для Каждого СтрокаТЧ Из Строка.Строки Цикл
					Если Строка.Добавить = 1 Тогда
						ДобавитьСвойствоТипаДанных(Владелец, Родитель, СтрокаТЧ, ПеречисленияСпецификации);
					КонецЕсли;
				КонецЦикла;
				
			Иначе
				ДобавитьСвойствоТипаДанных(Владелец, ТипДанных, Строка, ПеречисленияСпецификации);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПодчиненныеЭлементы(Родитель, Строки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.ПометкаУдаления КАК ПометкаУдаления,
	|	Т.Владелец КАК Владелец,
	|	Т.Родитель КАК Родитель,
	|	Т.Код КАК Код,
	|	Т.Наименование КАК Наименование,
	|	Т.Описание КАК Описание,
	|	Т.ТипДанных КАК ТипДанных,
	|	Т.ФорматДанных КАК ФорматДанных,
	|	Т.Минимум КАК Минимум,
	|	Т.Максимум КАК Максимум,
	|	Т.Перечисление КАК Перечисление,
	|	Т.РегулярноеВыражение КАК РегулярноеВыражение,
	|	Т.Устарело КАК Устарело,
	|	Т.Обязательное КАК Обязательное,
	|	Т.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	|	Т.ОбъектКонфигурации КАК ОбъектКонфигурации
	|ИЗ
	|	Справочник.кфкТипыДанныхСпецификации КАК Т
	|ГДЕ
	|	Т.Родитель = &Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА Т.ТипДанных = ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Массив)
	|			ТОГДА 3
	|		КОГДА Т.ТипДанных = ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Структура)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т2.Ссылка КАК Ссылка,
	|	Т2.Тип КАК Тип
	|ИЗ
	|	Справочник.кфкТипыДанныхСпецификации КАК Т1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.кфкТипыДанныхСпецификации.БазовыеТипы КАК Т2
	|		ПО Т1.Ссылка = Т2.Ссылка
	|ГДЕ
	|	Т1.Родитель = &Родитель";
	Запрос.УстановитьПараметр("Родитель", Родитель);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаБазовыеТипы = РезультатЗапроса[1].Выбрать();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	//@skip-check query-in-loop
	Пока Выборка.Следующий() Цикл
		
		// Описание элемента
		НоваяСтрока = Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если Выборка.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Массив Тогда
			// Вложенные элементы
			ДобавитьПодчиненныеЭлементы(Выборка.Ссылка, НоваяСтрока.Строки);
			
		ИначеЕсли Выборка.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Структура Тогда
			// Вложенные элементы
			ДобавитьПодчиненныеЭлементы(Выборка.Ссылка, НоваяСтрока.Строки);
			// Заполняем список базовых типов
			БазовыеТипы = Новый Массив;
			БазовыеТипыСтрокой = Новый Массив;
			ВыборкаБазовыеТипы = РезультатЗапроса[1].Выбрать();
			Пока ВыборкаБазовыеТипы.НайтиСледующий(Выборка.Ссылка, "Ссылка") Цикл
				БазовыеТипы.Добавить(ВыборкаБазовыеТипы.Тип);
				БазовыеТипыСтрокой.Добавить(ОбщегоНазначения.СтроковоеПредставлениеТипа(ВыборкаБазовыеТипы.Тип));
				// Вложенные элементы
				ДобавитьПодчиненныеЭлементы(ВыборкаБазовыеТипы.Тип, НоваяСтрока.Строки);
			КонецЦикла;
			НоваяСтрока.БазовыеТипы = Новый ФиксированныйМассив(БазовыеТипы);
			НоваяСтрока.БазовыеТипыСтрокой = СтрСоединить(БазовыеТипы, ",");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДобавитьСвойствоТипаДанных(Владелец, Родитель, Реквизит, ПеречисленияСпецификации)
	
	Если ЗначениеЗаполнено(Реквизит.Ссылка) Тогда
		Возврат Реквизит.Ссылка;
	КонецЕсли;
	
	Если ПустаяСтрока(Реквизит.Свойство) Тогда
		ВызватьИсключение СтрШаблон("Не заполнено наименование свойства %1", Реквизит.СвойствоКонфигурации);
	КонецЕсли;
	
	Объект = СоздатьЭлемент();
	Объект.Владелец = Владелец;
	Объект.Родитель = Родитель;
	Объект.Код = Реквизит.Свойство;
	Объект.Наименование = Реквизит.СвойствоКонфигурацииНаименование;
	Объект.Описание = Реквизит.СвойствоКонфигурацииСиноним;
	Объект.ТипДанных = Реквизит.ТипДанных;
	Объект.ФорматДанных = Реквизит.ФорматДанных;
	Объект.Минимум = ?(Реквизит.Минимум = Неопределено, -1, Реквизит.Минимум);
	Объект.Максимум = ?(Реквизит.Максимум = Неопределено, -1, Реквизит.Максимум);
	
	Если Реквизит.ТипОбъекта = Перечисления.ТипыОбъектов.Перечисление Тогда
		Если Не ЗначениеЗаполнено(Реквизит.Перечисление) Тогда
//			Продолжить;
			
		ИначеЕсли ТипЗнч(Реквизит.Перечисление) = Тип("СправочникСсылка.кфкПеречисленияСпецификации") Тогда
			Объект.Перечисление = Реквизит.Перечисление;
			
		ИначеЕсли ТипЗнч(Реквизит.Перечисление) = Тип("СправочникСсылка.Свойства") Тогда
			Объект.Перечисление = ПеречисленияСпецификации.Получить(Реквизит.Перечисление);
			Если Не ЗначениеЗаполнено(Объект.Перечисление) Тогда
				Объект.Перечисление = Справочники.кфкПеречисленияСпецификации.Создать(
					Владелец, Реквизит.Перечисление, Реквизит.Свойство + "Enum");
				ПеречисленияСпецификации.Вставить(Реквизит.Перечисление, Объект.Перечисление);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Объект.ОбъектКонфигурации = Реквизит.СвойствоКонфигурации;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
