#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Код");
	Поля.Добавить("Наименование");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтрШаблон("%1 (%2)", Данные.Код, Данные.Наименование);
	
КонецПроцедуры

Процедура ОбработкаПослеЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий)
	
	РегистрыСведений.кфкИзмененияОбъектовСпецификаций.ОбработкаЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает пометку удаления элемента типа данных.
//
// Параметры:
//	Ссылка - СправочникСсылка.кфкТипыДанныхСпецификации - Изменяемый элемент.
//	ПометкаУдаления - Булево - Новое значение пометки.
Процедура УстановитьПометкуУдаления(Ссылка, ПометкаУдаления) Экспорт

	Объект = Ссылка.ПолучитьОбъект();
	Объект.УстановитьПометкуУдаления(ПометкаУдаления);
	Объект.Записать();

КонецПроцедуры

// Возвращает структуру с описанием типа данных
// 
// Параметры:
//	Ссылка - СправочникСсылка.кфкТипыДанныхСпецификации - Ссылка
// 
// Возвращаемое значение:
//	Структура - Описание типа:
//		* Ссылка - СправочникСсылка.кфкТипыДанныхСпецификации - Ссылка
//		* Владелец - СправочникСсылка.кфкСпецификации - Владелец
//		* Родитель - СправочникСсылка.кфкТипыДанныхСпецификации - Родитель
//		* Код - Строка - Код
//		* Наименование - Строка - Наименование
//		* ПометкаУдаления - Булево - ПометкаУдаления
//		* Описание - Строка - Описание
//		* ТипДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - ТипДанных
//		* ФорматДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - ФорматДанных
//		* Минимум - Число - Минимум
//		* Максимум - Число - Максимум
//		* Перечисление - СправочникСсылка.кфкПеречисленияСпецификации - Перечисление
//		* РегулярноеВыражение - Строка - РегулярноеВыражение
//		* Устарело - Булево - Устарело
//		* Обязательное - Булево - Обязательное
//		* ЗначениеПоУмолчанию - Неопределено,Строка,Число,Дата,Булево - ЗначениеПоУмолчанию
//		* ОбъектКонфигурации - Неопределено,СправочникСсылка.Объекты, СправочникСсылка.Свойства - Объект или свойство конфигурации
//		* ОбъектКонфигурацииТипыСтрокой - Неопределено,Строка - Типы объекта или свойства конфигурации
//		* БазовыеТипы - ФиксированныйМассив Из СправочникСсылка.кфкТипыДанныхСпецификации - Базовые типы
//		* БазовыеТипыСтрокой - Строка - Базовые типы в виде строки
Функция ОписаниеТипа(Ссылка) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", ПустаяСсылка());
	Результат.Вставить("ПометкаУдаления", Ложь);
	Результат.Вставить("Владелец", Справочники.кфкСпецификации.ПустаяСсылка());
	Результат.Вставить("Родитель", ПустаяСсылка());
	Результат.Вставить("Код", "");
	Результат.Вставить("Наименование", "");
	Результат.Вставить("Описание", "");
	Результат.Вставить("ТипДанных", Справочники.кфкТипыЗначенийСпецификации.ПустаяСсылка());
	Результат.Вставить("ФорматДанных", Справочники.кфкТипыЗначенийСпецификации.ПустаяСсылка());
	Результат.Вставить("Минимум", 0);
	Результат.Вставить("Максимум", 0);
	Результат.Вставить("Перечисление", Справочники.кфкПеречисленияСпецификации.ПустаяСсылка());
	Результат.Вставить("РегулярноеВыражение", "");
	Результат.Вставить("Устарело", Ложь);
	Результат.Вставить("Обязательное", Ложь);
	Результат.Вставить("ЗначениеПоУмолчанию", Неопределено);
	Результат.Вставить("ОбъектКонфигурации", Неопределено);
	Результат.Вставить("ОбъектКонфигурацииТипыСтрокой", Неопределено);
	Результат.Вставить("БазовыеТипы", Новый ФиксированныйМассив(Новый Массив));
	Результат.Вставить("БазовыеТипыСтрокой", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т1.Ссылка КАК Ссылка,
	|	Т1.ПометкаУдаления КАК ПометкаУдаления,
	|	Т1.Владелец КАК Владелец,
	|	Т1.Родитель КАК Родитель,
	|	Т1.Код КАК Код,
	|	Т1.Наименование КАК Наименование,
	|	Т1.Описание КАК Описание,
	|	Т1.ТипДанных КАК ТипДанных,
	|	Т1.ФорматДанных КАК ФорматДанных,
	|	Т1.Минимум КАК Минимум,
	|	Т1.Максимум КАК Максимум,
	|	Т1.Перечисление КАК Перечисление,
	|	Т1.РегулярноеВыражение КАК РегулярноеВыражение,
	|	Т1.Устарело КАК Устарело,
	|	Т1.Обязательное КАК Обязательное,
	|	Т1.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	|	Т1.ОбъектКонфигурации КАК ОбъектКонфигурации,
	|	ВЫБОР
	|		КОГДА Т2.Ссылка ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА Т2.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ТабличнаяЧасть)
	|			ТОГДА ""ТабличнаяЧасть""
	|		ИНАЧЕ Т2.ТипыСтрокой
	|	КОНЕЦ КАК ОбъектКонфигурацииТипыСтрокой
	|ИЗ
	|	Справочник.кфкТипыДанныхСпецификации КАК Т1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Свойства КАК Т2
	|		ПО Т1.ОбъектКонфигурации = Т2.Ссылка
	|ГДЕ
	|	Т1.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Тип КАК Тип
	|ИЗ
	|	Справочник.кфкТипыДанныхСпецификации.БазовыеТипы КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		
		// Описание элемента
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		// ТЧ БазовыеТипы
		Если Выборка.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Структура Тогда
			
			БазовыеТипы = Новый Массив;
			БазовыеТипыСтрокой = Новый Массив;
			
			ВыборкаБазовыеТипы = РезультатЗапроса[1].Выбрать();
			Пока ВыборкаБазовыеТипы.Следующий() Цикл
				БазовыеТипы.Добавить(ВыборкаБазовыеТипы.Тип);
				БазовыеТипыСтрокой.Добавить(ОбщегоНазначения.СтроковоеПредставлениеТипа(ВыборкаБазовыеТипы.Тип));
			КонецЦикла;
			
			Результат.БазовыеТипы = Новый ФиксированныйМассив(БазовыеТипы);
			Результат.БазовыеТипыСтрокой = СтрСоединить(БазовыеТипы, ",");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает подчиненные элементы справочника
// 
// Параметры:
//	Родитель - СправочникСсылка.кфкТипыДанныхСпецификации - Родитель
// 
// Возвращаемое значение:
//	ДеревоЗначений - Подчинные элементы:
//		* Ссылка - СправочникСсылка.кфкТипыДанныхСпецификации - Ссылка
//		* Владелец - СправочникСсылка.кфкСпецификации - Владелец
//		* Родитель - СправочникСсылка.кфкТипыДанныхСпецификации - Родитель
//		* Код - Строка - Код
//		* Наименование - Строка - Наименование
//		* ПометкаУдаления - Булево - ПометкаУдаления
//		* Описание - Строка - Описание
//		* ТипДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - ТипДанных
//		* ФорматДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - ФорматДанных
//		* Минимум - Число - Минимум
//		* Максимум - Число - Максимум
//		* Перечисление - СправочникСсылка.кфкПеречисленияСпецификации - Перечисление
//		* РегулярноеВыражение - Строка - РегулярноеВыражение
//		* Устарело - Булево - Устарело
//		* Обязательное - Булево - Обязательное
//		* ЗначениеПоУмолчанию - Строка,Число,Дата,Булево - ЗначениеПоУмолчанию
//		* ОбъектКонфигурации - СправочникСсылка.Объекты, СправочникСсылка.Свойства - Объект или свойство конфигурации
//		* ОбъектКонфигурацииТипыСтрокой - Строка - Типы объекта конфигурации в виде строки
//		* БазовыеТипы - ФиксированныйМассив Из СправочникСсылка.кфкТипыДанныхСпецификации - Базовые типы
//		* БазовыеТипыСтрокой - Строка - Базовые типы в виде строки
Функция ПодчинныеЭлементы(Родитель) Экспорт
	
	Результат = Новый ДеревоЗначений;
	// Создаем колонки дерева значений
	ОбъектМетаданных = Метаданные.Справочники.кфкТипыДанныхСпецификации;
	Для Каждого ИмяРеквизита Из СтрРазделить("Ссылка,Владелец,Родитель,Код,Наименование,ПометкаУдаления", ",") Цикл
		Результат.Колонки.Добавить(ИмяРеквизита, ОбъектМетаданных.СтандартныеРеквизиты[ИмяРеквизита].Тип);
	КонецЦикла;
	Для Каждого Реквизит Из Метаданные.Справочники.кфкТипыДанныхСпецификации.Реквизиты Цикл
		Результат.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;
	Результат.Колонки.Добавить("ОбъектКонфигурацииТипыСтрокой", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Результат.Колонки.Добавить("БазовыеТипы", Новый ОписаниеТипов("ФиксированныйМассив"));
	Результат.Колонки.Добавить("БазовыеТипыСтрокой", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	ДобавитьПодчиненныеЭлементы(Родитель, Результат.Строки);
	
	Возврат Результат;
	
КонецФункции

// Создает свойства типа данных
// 
// Параметры:
//	Владелец - СправочникСсылка.кфкСпецификации - Владелец
//	ТипДанных - СправочникСсылка.кфкТипыДанныхСпецификации - Тип данных
//	Дерево - ДеревоЗначений - Дерево свойств:
//		* Добавить - Число - Признак добавления свойства, 0 - не добавлять, 1 - добавить всю цепочку, 2 - добавить часть подчиненных элементов
//		* СвойствоКонфигурации - СправочникСсылка.Свойства - Свойство конфигурации
//		* СвойствоКонфигурацииНаименование - Строка - Наименование свойства конфигурации
//		* СвойствоКонфигурацииСиноним - Строка - Синоним свойства конфигурации
//		* ТипСвойстваКонфигурации - СправочникСсылка.Объекты - Тип свойства конфигурации
//		* Тип - СправочникСсылка.Объекты - Тип
//		* ТипТипа - ПеречислениеСсылка.ТипыОбъектов - Тип типа
//		* Свойство - Строка - Свойство
//		* ТипДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - Тип данных
//		* ФорматДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - Формат данных
//		* Перечисление - СправочникСсылка.кфкПеречисленияСпецификации - Перечисление
//		* Минимум - Число - Минимум
//		* Максимум - Число - Максимум
//		* Ссылка - СправочникСсылка.кфкТипыДанныхСпецификации - Ссылка
// 
// Возвращаемое значение:
//	Структура - Результат создания свойств:
//		* Успешно - Булево - Признак успешного создания свойств
//		* ТекстОшибки - Строка - Текст ошибки
Функция СоздатьСвойства(Владелец, ТипДанных, Дерево) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Истина);
	Результат.Вставить("ТекстОшибки", "");
	
	ПеречисленияСпецификации = Новый Соответствие;
	
	НачатьТранзакцию();
	Попытка
		
		Для Каждого Строка Из Дерево.Строки Цикл
			
			Если Строка.Добавить = 0 Тогда
				Продолжить;
				
			ИначеЕсли Строка.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Массив Тогда // Табличная часть
				Родитель = ДобавитьСвойствоТипаДанных(Владелец, ТипДанных, Строка, ПеречисленияСпецификации);
				ОписаниеТЧ = ОписаниеСтрокиТЧ(Строка);
				ЭлементМассива = ДобавитьСвойствоТипаДанных(Владелец, Родитель, ОписаниеТЧ, ПеречисленияСпецификации);
				Для Каждого СтрокаТЧ Из Строка.Строки Цикл
					Если СтрокаТЧ.Добавить = 1 Тогда
						ДобавитьСвойствоТипаДанных(Владелец, ЭлементМассива, СтрокаТЧ, ПеречисленияСпецификации);
					КонецЕсли;
				КонецЦикла;
				
			Иначе
				ДобавитьСвойствоТипаДанных(Владелец, ТипДанных, Строка, ПеречисленияСпецификации);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВидПовышения(Данные, История, ЭтоНовый) Экспорт
	
	ВидыПовышения = Перечисления.кфкВидыПовышенияВерсий;
	Если ТипЗнч(История) = Тип("ИнформацияОЗаписиВерсииИсторииДанных") Тогда
		Возврат кфкРаботаСоСпецификациями.ПолучитьИндексСобытия(
			История, ЭтоНовый, ВидыПовышения.ДополняющаяВерсия, ВидыПовышения.ОсновнаяВерсия);
	КонецЕсли;
	
	РезультатыКлассификации = Новый Массив;
	Для Каждого КлючЗначение Из История Цикл
		ВидПовышения = ВидПовышенияИзменения(КлючЗначение.Ключ, КлючЗначение.Значение);
		Если КлючЗначение.Ключ = "ПометкаУдаления" Тогда
			РезультатыКлассификации.Очистить();
		КонецЕсли;
		РезультатыКлассификации.Добавить(ВидПовышения);
		Если КлючЗначение.Ключ = "ПометкаУдаления" Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат кфкРаботаСоСпецификациями.ПолучитьИндексИзменений(
		РезультатыКлассификации);

КонецФункции





#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВидПовышенияИзменения(ИмяРеквизита, Изменения)

	ВидыПовышения = Перечисления.кфкВидыПовышенияВерсий;
	Если ИмяРеквизита = "Владелец" Тогда
		ВызватьИсключение НСтр("ru = 'Нельзя изменять спецификацию!'");
	ИначеЕсли ИмяРеквизита = "Родитель" Тогда
		ВызватьИсключение НСтр("ru = 'Нельзя изменять родителя!'");
	ИначеЕсли ИмяРеквизита = "ПометкаУдаления" Тогда
		Возврат ?(Изменения.ЗначениеПослеИзменения,
			ВидыПовышения.ОсновнаяВерсия, ВидыПовышения.ДополняющаяВерсия);
	ИначеЕсли ИмяРеквизита = "Код" Или ИмяРеквизита = "ТипДанных" Тогда
		Возврат ВидыПовышения.ОсновнаяВерсия;
	ИначеЕсли ИмяРеквизита = "Наименование" Или ИмяРеквизита = "Описание"
			Или ИмяРеквизита = "ОбъектКонфигурации" Тогда
		Возврат ВидыПовышения.ВерсияИсправления;
	ИначеЕсли ИмяРеквизита = "ФорматДанных" Тогда
		Возврат ?(ЗначениеЗаполнено(Изменения.ЗначениеПослеИзменения),
			ВидыПовышения.ДополняющаяВерсия, ВидыПовышения.ВерсияИсправления);
	ИначеЕсли ИмяРеквизита = "Минимум" Тогда
		ЗначениеДоИзменения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			Изменения, "ЗначениеДоИзменения", -1);
		Возврат ?(ЗначениеДоИзменения < Изменения.ЗначениеПослеИзменения,
			ВидыПовышения.ДополняющаяВерсия, ВидыПовышения.ВерсияИсправления);
	ИначеЕсли ИмяРеквизита = "Максимум" Тогда
		ЗначениеДоИзменения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			Изменения, "ЗначениеДоИзменения", -1);
		Возврат ?(ЗначениеДоИзменения > Изменения.ЗначениеПослеИзменения,
			ВидыПовышения.ДополняющаяВерсия, ВидыПовышения.ВерсияИсправления);
	ИначеЕсли ИмяРеквизита = "Перечисление" Или ИмяРеквизита = "РегулярноеВыражение"
			Или ИмяРеквизита = "ЗначениеПоУмолчанию" Тогда
		Возврат ?(ЗначениеЗаполнено(Изменения.ЗначениеПослеИзменения),
			ВидыПовышения.ДополняющаяВерсия, ВидыПовышения.ВерсияИсправления);
	ИначеЕсли ИмяРеквизита = "Устарело" Тогда
		Возврат ?(Изменения.ЗначениеПослеИзменения,
			ВидыПовышения.ДополняющаяВерсия, ВидыПовышения.ВерсияИсправления);
	ИначеЕсли ИмяРеквизита = "Обязательное" Тогда
		Возврат ?(Изменения.ЗначениеПослеИзменения,
			ВидыПовышения.ВерсияИсправления, ВидыПовышения.ДополняющаяВерсия);
	ИначеЕсли ИмяРеквизита = "БазовыеТипы" Тогда
		Возврат ВидПовышенияБазовыхТипов(Изменения);
	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестное имя реквизита: %1'"), ИмяРеквизита);
	КонецЕсли;

КонецФункции

Функция ВидПовышенияБазовыхТипов(Изменения)

	ВидыПовышения = Перечисления.кфкВидыПовышенияВерсий;
	Для Каждого Элемент Из Изменения Цикл
		Если Элемент.ВидИзмененияСтроки = ВидИзмененияСтрокиДанных.Изменение
				Или Элемент.ВидИзмененияСтроки = ВидИзмененияСтрокиДанных.Удаление Тогда
			Возврат ВидыПовышения.ДополняющаяВерсия;
		КонецЕсли;
	КонецЦикла;

	Возврат ВидыПовышения.ВерсияИсправления;

КонецФункции

Процедура ДобавитьПодчиненныеЭлементы(Родитель, Строки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т1.Ссылка КАК Ссылка,
	|	Т1.ПометкаУдаления КАК ПометкаУдаления,
	|	Т1.Владелец КАК Владелец,
	|	Т1.Родитель КАК Родитель,
	|	Т1.Код КАК Код,
	|	Т1.Наименование КАК Наименование,
	|	Т1.Описание КАК Описание,
	|	Т1.ТипДанных КАК ТипДанных,
	|	Т1.ФорматДанных КАК ФорматДанных,
	|	Т1.Минимум КАК Минимум,
	|	Т1.Максимум КАК Максимум,
	|	Т1.Перечисление КАК Перечисление,
	|	Т1.РегулярноеВыражение КАК РегулярноеВыражение,
	|	Т1.Устарело КАК Устарело,
	|	Т1.Обязательное КАК Обязательное,
	|	Т1.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	|	Т1.ОбъектКонфигурации КАК ОбъектКонфигурации,
	|	ВЫБОР
	|		КОГДА Т2.Ссылка ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА Т2.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ТабличнаяЧасть)
	|			ТОГДА ""ТабличнаяЧасть""
	|		ИНАЧЕ Т2.ТипыСтрокой
	|	КОНЕЦ КАК ОбъектКонфигурацииТипыСтрокой
	|ИЗ
	|	Справочник.кфкТипыДанныхСпецификации КАК Т1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Свойства КАК Т2
	|		ПО Т1.ОбъектКонфигурации = Т2.Ссылка
	|ГДЕ
	|	Т1.Родитель = &Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА Т1.ТипДанных = ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Массив)
	|			ТОГДА 3
	|		КОГДА Т1.ТипДанных = ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Структура)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т2.Ссылка КАК Ссылка,
	|	Т2.Тип КАК Тип
	|ИЗ
	|	Справочник.кфкТипыДанныхСпецификации КАК Т1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.кфкТипыДанныхСпецификации.БазовыеТипы КАК Т2
	|		ПО Т1.Ссылка = Т2.Ссылка
	|ГДЕ
	|	Т1.Родитель = &Родитель";
	Запрос.УстановитьПараметр("Родитель", Родитель);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаБазовыеТипы = РезультатЗапроса[1].Выбрать();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	//@skip-check query-in-loop
	Пока Выборка.Следующий() Цикл
		
		// Описание элемента
		НоваяСтрока = Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если Выборка.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Массив Тогда
			// Вложенные элементы
			ДобавитьПодчиненныеЭлементы(Выборка.Ссылка, НоваяСтрока.Строки);
			
		ИначеЕсли Выборка.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Структура Тогда
			// Вложенные элементы
			ДобавитьПодчиненныеЭлементы(Выборка.Ссылка, НоваяСтрока.Строки);
			// Заполняем список базовых типов
			БазовыеТипы = Новый Массив;
			БазовыеТипыСтрокой = Новый Массив;
			ВыборкаБазовыеТипы = РезультатЗапроса[1].Выбрать();
			Пока ВыборкаБазовыеТипы.НайтиСледующий(Выборка.Ссылка, "Ссылка") Цикл
				БазовыеТипы.Добавить(ВыборкаБазовыеТипы.Тип);
				БазовыеТипыСтрокой.Добавить(ОбщегоНазначения.СтроковоеПредставлениеТипа(ВыборкаБазовыеТипы.Тип));
				// Вложенные элементы
				ДобавитьПодчиненныеЭлементы(ВыборкаБазовыеТипы.Тип, НоваяСтрока.Строки);
			КонецЦикла;
			НоваяСтрока.БазовыеТипы = Новый ФиксированныйМассив(БазовыеТипы);
			НоваяСтрока.БазовыеТипыСтрокой = СтрСоединить(БазовыеТипы, ",");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОписаниеСтрокиТЧ(ТабличнаяЧасть)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Ссылка", Неопределено);
	Если Не ТабличнаяЧасть.Ссылка.Пустая() Тогда
		Выборка = Выбрать(ТабличнаяЧасть.Ссылка);
		Если Выборка.Следующий() Тогда
			Результат.Вставить("Ссылка", Выборка.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	Результат.Вставить("Свойство", ТабличнаяЧасть.Свойство + "Item");
	Результат.Вставить("СвойствоКонфигурацииНаименование", НСтр("ru = 'Строка табличной части'"));
	Результат.Вставить("СвойствоКонфигурацииСиноним", "");
	Результат.Вставить("ТипДанных", Справочники.кфкТипыЗначенийСпецификации.Структура);
	Результат.Вставить("ФорматДанных", Неопределено);
	Результат.Вставить("Минимум", Неопределено);
	Результат.Вставить("Максимум", Неопределено);
	Результат.Вставить("СвойствоКонфигурации", Неопределено);
	Результат.Вставить("Тип", Неопределено);
	Результат.Вставить("ТипТипа", Неопределено);
	Результат.Вставить("Перечисление", Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьСвойствоТипаДанных(Владелец, Родитель, Реквизит, ПеречисленияСпецификации)
	
	Если ЗначениеЗаполнено(Реквизит.Ссылка) Тогда
		Возврат Реквизит.Ссылка;
	КонецЕсли;
	
	Если ПустаяСтрока(Реквизит.Свойство) Тогда
		ВызватьИсключение СтрШаблон("Не заполнено наименование свойства %1", Реквизит.СвойствоКонфигурации);
	КонецЕсли;
	
	Объект = СоздатьЭлемент();
	Объект.Владелец = Владелец;
	Объект.Родитель = Родитель;
	Объект.Код = Реквизит.Свойство;
	Объект.Наименование = Реквизит.СвойствоКонфигурацииНаименование;
	Объект.Описание = Реквизит.СвойствоКонфигурацииСиноним;
	Объект.ТипДанных = Реквизит.ТипДанных;
	Объект.ФорматДанных = Реквизит.ФорматДанных;
	Объект.Перечисление = Реквизит.Перечисление;
	Объект.Минимум = ?(Реквизит.Минимум = Неопределено, -1, Реквизит.Минимум);
	Объект.Максимум = ?(Реквизит.Максимум = Неопределено, -1, Реквизит.Максимум);
	
	Если Реквизит.ТипТипа = Перечисления.ТипыОбъектов.Перечисление Тогда
		Если Не ЗначениеЗаполнено(Реквизит.Перечисление) И ЗначениеЗаполнено(Реквизит.Тип) Тогда
			Объект.Перечисление = ПеречисленияСпецификации.Получить(Реквизит.Тип);
			Если Не ЗначениеЗаполнено(Объект.Перечисление) Тогда
				Объект.Перечисление = Справочники.кфкПеречисленияСпецификации.Создать(
					Владелец, Реквизит.Тип, Реквизит.Свойство + "Enum");
				ПеречисленияСпецификации.Вставить(Реквизит.Тип, Объект.Перечисление);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Объект.ОбъектКонфигурации = Реквизит.СвойствоКонфигурации;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
